help	3394
with	65250
the	587345
new	8487
dance	1516
studio	583
.	545819
honey	521
gets	5451
a	234433
bank	611
loan	61
,	401622
and	251897
puts	820
down	7223
deposit	46
meanwhile	1223
pitches	35
an	32400
idea	1670
to	213699
ellis	91
for	61875
ginuwine	48
's	100128
video	1264
using	1605
kids	3209
she	26390
teaches	140
at	35241
centre	143
as	60059
back	10898
up	20713
dancers	64
acting	5160
like	32591
urban	197
pied	8
piper	81
gina	71
25th	97
birthday	442
comes	3619
little	6948
embarrassing	111
although	2398
in	164735
fairness	13
``	37847
''	36275
street	1951
talk	1604
does	12521
n't	41066
make	9334
you	68135
wince	35
much	13136
some	16112
other	11525
examples	143
of	196195
this	79809
kind	3442
thing	4806
be	34030
honest	767
movie	92170
pretty	5995
goes	4951
one	66889
ear	153
out	24636
;	9292
there	20178
not	38124
single	1182
truly	2511
dramatic	787
moment	2280
setbacks	14
coming	1754
on	46991
cue	31
(	39162
when	27021
li	138
'	12881
l	114
romeo	105
character	44442
arrested	469
it	159156
many	7634
moments	2743
plays	1982
less-than-brilliant	10
after	13248
school	2662
special	3437
)	39804
characters	11860
are	37094
right	6304
cliches	124
central	582
from	31167
almost	3991
saintly	10
title	1148
sexually	108
predatory	11
rival	312
dancer	217
note	828
filmmakers	532
:	15921
anyone	1907
who	28420
ever	8957
watched	2054
mtv	380
vh-1	7
et	21
al	792
will	16347
confirm	78
music	3872
videos	95
do	36729
credit	537
choreographer	23
screen	3527
...	19741
regardless	226
what	36769
that	110561
next	3528
numbers	284
provide	439
lift	113
corny	398
formulaic	182
brings	1066
wholesome	68
affirmative	9
side	2129
hip-hop	35
aesthetic	63
without	4349
being	9209
overly	249
preachy	8
eod	15636
i	181192
tend	376
agree	3748
nyt	327
review	1201
which	47846
says	3424
is	152990
take	5872
teaching	171
ballet	56
classes	104
her	31804
parents	1748
refuse	205
end	7751
credits	967
might	2518
say	6213
but	57106
impossible	923
really	19551
hate	1622
too	11667
harmless	160
good-tempered	8
get	12021
into	17047
hissyfit	7
over	8263
its	12036
drawbacks	27
though	6582
r	217
&	3207
b-flavoured	7
cameos	324
mean	2006
lot	6123
people	10255
see	15174
watch	8726
anime	80
whatever	650
never	8652
seen	8901
{	388
}	519
attractive	306
jessica	561
alba	199
energetic	94
<eor>	54558
gems	58
we	12892
each	3527
year	4671
love	11058
part	7570
your	13164
favorite	36325
?	54431
makes	6775
plans	792
atlantic	32
city	2089
slightly	831
similar	6761
plots	252
except	1122
glitter	7
likely	733
more	19882
black	2781
mark	1500
mariah	2
carey	102
book	4331
than	14593
about	30699
kind-hearted	2
young	3958
woman	2426
york	1370
uses	1435
dancing	1003
neighbourhood	10
meets	1605
walking	726
sorry	580
could	9827
resist	104
plucked	8
nightclub	86
become	2821
paula	141
abdul	6
21st	108
century	459
-	10957
even	12335
has	26934
mole	79
face	3270
aptly	42
named	1595
sweet-natured	2
if	16132
any	7869
benefit	173
system	500
slip	98
nice	2019
easy	1179
leave	2318
very	18098
behind	2016
filled	854
all	30118
realism	256
'd	2863
expect	1785
producer	258
legally	65
blonde	274
!	32020
my	48329
understanding	368
good	25192
oh	3981
fo	20
real	5222
watchable	297
fans	1823
genre	2017
ending	3585
where	13088
holds	839
abandoned	478
church	510
ofcourse	30
yeah	4038
same	6095
definitely	3994
away	5136
animals	758
ruins	184
playground	125
manny	153
built	509
ellies	5
baby	1787
female	1494
tyrannosaurus	11
momma	26
whose	991
eggs	157
sid	268
stole	516
soon	1776
returns	1965
carries	396
both	5038
underground	413
diego	282
pursuit	306
ellie	88
crash	478
eddie	721
seann	10
william	935
scott	1186
josh	453
peck	172
follow	1248
well	13877
discover	981
icy	82
cavern	106
leads	1129
vast	186
jungle	476
populated	133
by	35149
dinosaurs	202
thought	7520
extinct	28
here	4905
ankylosaurus	2
threatens	423
herd	218
despite	1939
diegos	1
efforts	263
fend	69
off	9270
they	39541
saved	825
further	884
crowd	461
angry	689
reptiles	18
insane	361
one-eyed	51
weasel	6
par	347
first	16891
just	23032
mixture	95
settings	128
vs.	209
older	683
ones	1145
've	6841
grown	519
especially	3310
scrat	79
can	14638
whole	3914
guy	3903
time	18683
around	4633
expecting	1434
mammoth	23
something	5599
unexpected	565
responds	179
decides	1446
parent	227
himself	4878
return	1912
he	72772
steals	644
three	3702
giant	1020
accidentally	534
bumps	98
only	13610
later	3371
realize	1170
're	5603
dinosaur	151
belong	166
mother	2453
mother-dinosaur	3
kidnaps	109
fighting	1142
big	3961
was	147265
think	42996
funny	9536
remember	13825
came	2617
adopts	32
apparently	671
finds	3094
call	1695
them	14068
eggbert	4
shelly	9
yoko	34
tells	5124
him	26628
put	3096
instead	2393
looks	2501
hatch	65
morning	858
tries	2741
his	59887
best	27449
raise	260
their	16267
rambunctious	55
behavior	381
scares	696
stunning	847
forgive	177
obvious	888
historical	188
loophole	15
were	14546
no	14265
during	3604
ice	1236
age	1542
actually	6107
have	30790
quite	3638
add	730
plot	6850
cool	2328
sense	2410
adventure	1664
throughout	2428
film	53708
somewhat	831
missing	1125
opinion	3926
previous	1704
installment	643
adds	534
fun	6755
thrilling	914
experience	1718
alongside	325
visuals	621
jokes	1282
general	1196
atmosphere	929
sum	182
things	4256
3	2807
above	963
average	739
animated	2218
'll	3452
appeal	363
emphasis	152
action	10213
nicely	370
crafted	471
fast-paced	140
sequel	3858
animation	1460
art	1224
seuss-imaginative	8
flatness	6
story	14576
indifferent	83
voicework	5
latifah	7
ray	790
romano	23
child	1854
obsessed	256
making	2936
life	8603
perfect	3808
safe	708
family	5486
since	3686
experiences	283
husband	784
father	4101
went	2575
bad	8447
killed	3124
hunters	52
denis	50
leary	134
unable	556
catch	859
cocky	45
gazelle	1
bill	1062
hader	20
been	11339
stalking	53
believing	307
losing	443
nature	773
tiger	417
john	4437
leguizamo	5
grows	439
jealous	105
cute	1106
insulting	121
sometimes	1454
menacing	246
our	2839
friends	2922
would	12660
need	2395
cross	621
order	1790
rescue	852
dawn	368
goods	88
appeals	36
grown-ups	14
alike	195
true	4906
films	10237
joyous	58
delight	350
liked	32398
yes	5936
delivers	930
able	2378
block	243
shot	2663
makeshift	50
goal	107
area	633
beckham	19
set	2948
blocks	98
james	2719
agrees	618
buy	665
another	5443
mildly	87
threatening	331
defective	14
team	2120
desert	368
detonate	90
explosives	131
collected	61
missions	75
prepare	376
explode	220
bomb	937
stops	691
sanborn	39
deeply	546
emotional	1735
depicting	137
thoroughly	544
disturbed	130
individual	453
hell	1598
jeremy	376
renner	184
gives	2833
incredibly	1090
powerful	1500
performance	4731
officer	780
completely	2333
hooked	130
adrenaline	174
stemming	8
everyday	175
close	1331
shaves	13
death	3791
aspects	464
film-making	128
top-notch	102
brilliantly	558
subversive	135
screenplay	1244
through	7677
vivid	166
cinematography	1373
masterful	231
directing	939
perfectly	1389
paced	380
editing	1074
storytelling	388
wisely	75
break	1097
traditional	199
hollywood	1924
narrative	568
techniques	151
clear	1005
antagonist	57
rising	184
great	23070
done	3890
enjoyable	2036
particularly	802
rewatchable	59
suspenseful	561
packed	641
how	16893
lieutenant	356
colonel	365
cambridge	23
die	1797
happened	2115
psychiatrist	90
type	960
cell	425
phone	1108
enemy	611
briefly	313
drive	828
blast	318
zone	327
gloves	29
left	3042
while	9384
gone	1594
eldridge	32
study	430
taut	74
thriller	1597
once	3244
subject	480
matter	1139
itself	1790
work	4854
expert	275
possibly	791
most	15009
nerve-racking	5
jobs	251
planet	1526
yields	28
suspense	1447
bigelow	57
manages	1617
squeeze	28
every	7007
bit	3291
tension	1098
premise	465
me	18996
apolitical	4
iraq	95
distinguished	45
iraq-themed	4
war	3167
concentrates	28
second	2945
tour	397
because	22739
becomes	2333
bored	576
civillian	31
sergeant	206
relaxing	47
bunk	34
main	3340
pulling	334
bombs	137
ground	733
master	805
filmmaker	234
occupants	71
standing	469
threat	421
men	2987
near	1565
vehicles	203
quickly	1465
obey	23
dropping	162
weapons	429
reveals	1387
british	870
commando	6
unit	404
relaxes	23
job	4410
political	413
environment	109
high-anxiety	13
beginning	2195
fuzzy	19
hardly	414
original	6738
psychology	78
signs	254
artificially	51
straining	35
depth	960
class	905
cliche	160
begins	2541
intense	1187
approach	488
so	28683
glad	867
frag	3
exploding	170
claiming	227
accidental	55
seems	3585
intent	151
doing	1871
convinces	423
heading	239
sees	2118
two	8991
suvs	3
parked	41
route	210
addiction	146
kudos	156
everyone	4783
involved	970
compromising	29
pure	852
quality	1233
cinematic	796
thinking	1631
man	9268
actioner	19
explosion	373
kathryn	55
know	9215
worse	875
made	11345
civilians	48
trying	2931
seriously	1308
or	14853
battle	1985
los	395
angeles	380
shamelessly	53
exploits	63
marines	132
gi	20
joes	82
look	4440
shit	1748
recruiting	48
stupid	1381
teenagers	281
thanks	1005
posting	72
interesting	3847
actual	765
vet	60
feels	1687
leading	962
contender	70
academy	1516
awards	10302
barely	572
perceptible	12
ringing	43
tinnitus	12
amp	19
confronts	612
shattering	70
going	6228
give	4016
move	1333
meet	1934
dean	204
criteria	80
keep	2434
mitch	225
house	4489
reason	2248
bernard	162
start	2092
fraternity	148
open	1379
initially	340
reluctant	177
accept	520
notion	156
turning	449
essentially	258
obliged	68
taped	40
godawful	45
jennifer	567
aniston	104
debacle	5
picture	3133
explanation	327
said	2549
those	5237
old	4872
funniest	1627
scenes	7605
history	1629
gordon	522
frank	1812
played	4212
farrell	262
reckless	151
hysterical	238
heart	2335
attack	1179
ky	41
jelly	45
wrestling	66
match	545
debate	123
carville	61
falls	1317
mock	77
trance	100
long-winded	32
coherent	165
answer	534
question	946
government	810
involvement	179
biotechnology	32
innovation	85
mr.	1548
concedes	38
arguement	29
exclaimes	29
streaking	46
party	1635
crass	125
humor	2312
certain	1202
demographic	65
understands	196
fashioned	115
r-rated	90
scene	18520
did	20466
darcie	22
elisha	7
cuthbert	7
concerned	362
assures	85
simply	2085
casual	128
sex	1556
aftermath	136
trio	319
pritchard	25
piven	69
childhood	526
acquaintance	22
butt	211
movies	18343
laughed	758
hard	2929
heard	1373
reviews	1414
ca	4784
believe	3147
copies	64
kinda	558
bogged	37
had	15282
rank	147
spider-man	764
now	6963
#	744
1	1323
2	5613
homecoming	59
4	1463
5	1460
amazing	4383
6	573
awesome	3067
after-credits	32
welcome	620
abandon	99
granite	35
washington	369
monument	45
crystal	307
crazy	1323
attention	1519
detail	662
else	2432
already	1878
'm	6413
gon	775
na	1009
kill	3437
dead	3231
line	2678
post	604
then	10962
shows	2615
sony	28
colombia	70
logo	87
dubbed	95
godfather	555
greatest	1968
created	1134
yet	3937
go	8335
rent	309
borrow	46
steal	596
somehow	862
10/10	349
spidey	100
mcu	80
consistently	227
mandatory	66
friend	2293
haha	633
strains	7
marriage	314
wakes	426
comedy	5643
quotes	191
goin	20
bus	1003
mcmahon	31
wants	2212
jack	4370
explains	1001
news	781
helicopters	145
air	988
televising	4
event	405
payne	249
receives	320
regards	92
television	1396
consider	478
letting	251
wounded	323
driver	772
'the	532
fact	3591
non-stop	208
thrills	416
chills	206
spills	122
however	4813
dennis	250
hopper	219
complex	832
probably	3263
should	6089
garnered	74
oscar	1094
nomination	153
spite	165
stars	955
5.	14
gap	79
bridge	633
trolley	45
cart	118
speeding	114
diffuse	43
exciting	1268
annie	680
concept	555
alright	318
doubt	1118
hold	861
howard	478
wildcat	5
wheel	198
slow	674
passenger	90
helen	262
beth	207
grant	470
edgy	122
attempts	1363
stands	816
entrance-way	1
stairs	334
smaller	177
charge	296
destroys	251
platform	112
under	2102
run	1609
wheels	37
obstacle	60
rigged	59
speed	555
drops	360
below	346
50	436
miles	545
per	221
hour	1154
sandra	552
bullock	538
star-making	34
role	3970
unlucky	36
center	614
forced	1189
navigator	61
accidently	58
bitch	260
wanted	2363
aaron	409
paul	1269
fit	733
casting	861
imo	486
utterly	529
ridiculous	779
cheesy	892
dialogue	2370
watching	4389
'turn	75
brain	773
usual	928
rush	632
keanu	215
drove	185
asked	581
door	1585
charachter	262
travern	67
reacted	94
car	3961
insured	46
use	2706
rock-'em	39
runaway	45
success	847
1994	182
block-buster	15
word	1260
critically	56
speaking	438
excellent	3741
motion	1588
sock-'em	38
past	2175
25	327
years	5228
500	132
calm	358
pressure	178
traven	41
reeves	172
jumped	302
timing	198
amsterdam	163
10	1818
days	1733
harold	1126
rides	257
elevator	457
kumar	869
asks	2081
maria	210
touched	190
penis	35
reports	130
taken	2097
classic	3965
possible	997
ethnic	29
stereotype	26
zeal	14
equaled	21
'bad	36
santa	392
decimating	9
christmas	1113
formula	362
'castle	7
such	6756
imitating	13
roguish	7
hope/crosby	7
road	1121
pictures	644
commenting	73
egregious	34
weaknesses	123
police	3142
mind	2467
breast	63
bared	14
name	3017
satire	583
laugh	1566
heartily	10
modern	1012
adult	712
pretensions	14
youthful	77
indiscretion	8
find	6729
all-night	6
white	1691
castle	472
experiencing	100
sudden	282
yearning	46
afflicts	5
'slider	5
burger	23
square	143
fat	266
calories	8
pot	107
girls	1240
indulge	29
early	860
twenties	15
students	530
serious	1194
stock	215
analyst	6
bag	526
weed	140
station	935
neil	407
patrick	601
harris	513
always	5001
turned	1410
contrast	183
director	4632
danny	1478
leiner	7
'dude	7
hilarious	2781
stoner	151
everything	3894
dude	614
ends	1383
escape	2412
guantanamo	119
bay	474
picks	401
leaves	2066
lazy	341
pre-med	13
genius	502
hope	1564
crosby	54
witty	726
repartee	45
canny	11
ability	582
harm	127
delivered	626
wrath	299
deformed	60
'freak	3
show	3836
siren	38
wife	2034
deter	15
considering	725
affections	35
battling	174
babes	33
idolizing	3
cameo	606
playing	2025
lethal	141
womanizer	35
multicultural	5
subtext	59
stereotyping	30
asians	30
nerdy	128
number	1117
crunchers	5
indians	99
overachieving	8
medical	321
doctors	87
instance	190
overturned	18
morphing	18
seemingly	623
'joy	14
luck	210
club	635
gathering	46
raunchy	73
exposing	43
gang	1004
mouthy	21
skinheads	34
'girliemen	5
pop-cult	6
long	4111
last	4996
remake	1067
'starsky	4
hutch	4
indeed	1089
sunday	106
awkward	582
guts	325
brilliant	2412
place	2876
canon	94
own	4274
expense	86
akin	58
enjoying	168
articles	89
'playboy	4
buying	140
mags	11
suicide	447
squad	449
utilizes	13
loud	514
distracting	146
constant	333
key	870
accompanies	53
least	2534
felt	3137
wrong	2316
works	1582
stakes	89
monsters	448
goop	8
worried	387
antagonists	23
saw	4907
trailers	406
none	1255
fight	3718
meaning	479
faceless	14
cgi	1355
magical	355
uneven	124
dynamic	362
power	2057
issue	245
seem	2156
extremely	1305
unnecessary	628
frankly	195
misplaced	32
due	1249
disparity	10
between	3941
batman	1530
v.	134
superman	1691
stand	1221
small	1835
step	821
forward	880
leap	147
joker	644
harley	78
quinn	239
acted	870
demented	161
comic	2164
beating	306
satisfy	141
sake	305
nothing	3746
explained	273
want	4672
confusing	483
blend	280
predictable	896
unclear	33
found	4187
myself	1416
constantly	570
asking	600
why	6891
do____	4
enough	3499
members	761
rest	1831
deadshot	7
fleshed	117
feeble	26
background	717
dimension	154
complexity	225
fails	507
flashbacks	364
random	272
monologues	53
elicit	12
sort	1051
empathy	87
viewer	774
easily	1392
caring	262
example	978
point	3164
pacing	426
flesh	164
90s	76
used	2306
bone	157
film/soundtrack	10
guys	1763
lol	817
benefitted	18
budget	1051
guardians	112
galaxy	210
jesus	316
christ	213
cara	15
delevingne	14
twirling	13
fucking	1684
looked	1179
hula	13
leto	22
channel	200
nicholson	344
ledger	150
ayers	4
franco	232
'spring	6
breakers	30
am	3019
jai	112
courtney	96
boomerang	33
bar	683
symbolically	27
fairly	642
schemes	31
maybe	2104
sub	310
got	6064
8	516
still	10076
faults	62
nonetheless	275
times	3890
performances	2613
particular	822
include	369
details	597
overall	2319
better	8316
conclusion	586
difficult	864
spoiler	322
free	1057
may	3695
guilty	308
pleasure	361
subpar	40
helps	736
margot	51
robbie	464
outfit	70
before	7931
failed	375
also	11579
way	11691
hours	1305
30	727
minute	563
jump	1219
choose	251
drag	259
amongst	217
bodies	349
flip	39
transition	103
loved	6266
critics	2721
absolutely	2803
horrific	259
trash	312
words	964
ugly	317
amounts	193
all-out	34
entertainment	1180
kicks	246
fizzy	7
punk-rock	7
ferocity	16
flat	614
spiraling	7
familiar	702
formulas	5
dc	170
mess	471
common	360
complaint	154
defied	106
logic	224
trivial	45
sub-plot	65
amount	873
controversy	120
specific	187
late	1096
causing	659
faint	130
theatres	72
chronicles	63
aron	50
ralston	54
recklessly	15
arrogant	139
mountain	262
climber	7
arm	557
crushed	143
boulder	40
trip	776
utah	87
canyon	21
country	796
save	1837
must	3633
decide	614
whether	889
survival	220
logline	8
description	179
sound	1260
127	24
riveting	229
theatre	449
unsure	128
boyle	149
crew	1799
top	3978
oscar-winning	50
slumdog	82
millionaire	134
improves	205
upon	1552
majority	327
seeing	2902
life-altering	17
decision	419
stuff	1128
filmmaking	431
magic	998
until	2948
given	1867
limited	329
setting	889
mobility	7
escapes	817
asides	16
mere	238
stylishly	9
crazily	13
edited	269
pieces	607
naked	255
suv	68
standout	160
among	749
few	4595
interaction	169
audience	3085
adjust	23
deeper	465
mindset	60
aids	11
greater	188
authenticity	29
hallucinations	60
nearly	1202
these	4674
off-the-wall	11
lengthy	18
cast	4770
list	942
suggest	224
fleeting	66
glimpses	73
focused	337
claustrophobic	49
devastatingly	16
candid	9
piece	1665
driven	398
exclusively	31
facial	241
movements	180
reactions	192
2010	736
transformations	9
actors	3227
turn	1755
different	3358
camera	1603
us	4449
gritty	291
reality	1019
predicament	49
eerily	36
authentic	114
reminder	70
ima	3
finish	549
personally	626
itt	72
knows	1575
tom	2488
brokaw	4
feel	5473
stuck	649
courage	179
faces	462
mainly	437
interacting	21
themselves	1409
static	26
objects	151
spades	51
ensure	174
intensity	162
changes	552
eyes	1840
portrayal	720
pains	58
imperfections	3
wrap	68
head	2828
flawless	343
incredible	1844
cinema	1582
effects	3981
musical	857
choices	221
baffling	24
understand	1827
logistical	27
ideas	543
odd	435
insects	56
inhabit	36
surroundings	48
cgi'ed	3
visibly	51
fake	827
throw	429
unforgettable	326
money	3150
arms	436
weird	1007
triumph	173
moral	688
hiking	15
bring	1301
sharpened	14
bonesaw	6
anaesthetic	6
talking	1478
cutting	227
nerve	111
body	2242
collapse	78
ya	270
cleansing	3
high	2660
hopes	220
huge	1676
smile	324
authentically	11
merely	276
punctuated	3
handful	173
sea	461
filth	80
9.5/10	42
annoying	695
let	2858
hear	1141
alone	1822
beat	604
@	19
1:20	6
holy	487
voiceover	48
rating	429
buzz	648
strapped	123
rocket	342
yard	130
starts	1884
working	1083
ominous	122
empty	464
water	1431
jug	1
newscaster-style	1
narration	99
preparations	23
approaching	238
launch	208
woody	988
pleads	116
mutant	273
toys	534
hesitantly	22
join	781
room	3065
boy	2055
nervous	315
ignored	222
arrives	1326
cowboy	125
leader	838
popular	799
afraid	597
lightyear	108
hates	183
rid	179
rebelled	20
against	2207
front	1312
pizza	98
clever	1660
restaurant	510
evil	2652
neighbor	154
hears	503
doorbell	28
releases	235
wind-up	7
frog	199
scoots	5
scud	52
zooms	79
hall	325
chase	1500
follows	905
downstairs	142
hannah	89
answering	48
ducky	4
grabs	689
reeled	4
legs	298
come	4454
owner	317
asleep	226
limit	115
reach	494
sky	402
toy	925
damn	1205
closing	267
lost	2376
style	1658
disney	1967
razzle-dazzle	30
technique	205
unusual	278
loops	37
dizzying	74
fashion	308
takes	3991
breath	417
inventive	329
1995	355
all-time	304
outside	1523
removing	88
light	1444
fixture	9
porch	57
ring	751
computers	126
strong	2123
technology	575
creating	449
unknown	461
respect	688
creators	115
animations	117
8.5/10	9
influential	108
visual	1386
100	491
american	2948
betrayed	172
andy	1462
overcame	81
'person	18
slink	22
alive	1168
bed	773
fan	2648
pixar	1004
studios	270
growling	12
bedroom	326
passes	356
learn	1117
appreciate	658
human	2375
god	1858
released	931
ago	1178
decade	540
tell	2044
colossus	143
negasonic	39
angel	220
slams	82
charges	181
oddly	228
charming	744
antihero	23
fast-forwards	5
render	34
simple	1508
fresh	834
exactly	2252
deadpool	514
dirty	693
jolt	40
energy	564
beautifully	815
designed	267
employing	33
playful	83
available	134
repetitive	78
perfection	373
liking	177
girlfriend	994
ryan	742
ryenolds	12
person	1863
play	2353
vulgar	130
based	2125
experiments	104
romantic	1174
plus	421
marvel	473
experiment	296
hysterically	70
full	2363
inappropriate	34
holiday	205
celebrating	81
pegging	19
keeping	458
vanessa	283
chamber	326
wade	89
surprisingly	883
joke	731
lands	276
beauty	903
breathe	178
crack	226
wise	451
clinical	21
condition	167
stand-up	12
comedian	124
land	573
madman	41
albeit	119
entertaining	3771
case	1545
born	802
tragedy	282
praise	280
soooo	42
proud	271
gun	1658
professor	611
mcavoy	198
stewart	270
parallel	141
timelines	68
sexy	382
violent	959
unabashedly	65
arrived	273
swallow	110
spiderman	113
kiss	563
rainy	119
alley	248
*you	58
reynolds	358
succeeded	173
skills	573
*	633
afford	83
gigantic	88
18	251
loves	633
read	2342
books	1176
handle	273
real-world	23
language	573
violence	1485
superhero	636
%	1265
’	1568
ve	50
spell	196
francis	272
runs	1549
aircraft	142
diverse	92
adaptations	73
material	973
automatically	58
successful	645
decidedly	56
proved	250
p.	199
s.	766
imdb	215
users	43
reference	318
valid	115
helicarrier	41
final	2539
cat	585
litter	74
driveby	50
absolute	657
touching	1036
lil	114
regrown/	32
hand	1817
x-men	810
mansion	329
stop	2071
laughing	865
hugh	408
jackman/wolverine	36
references	493
priceless	187
fast	1341
gleefully	72
profane	31
fourth-wall-busting	10
subverts	10
wildly	101
entertaining—and	10
non-family-friendly—results	10
shouldn	25
t	948
neurotic	37
needy—and	12
world	5964
s	932
bugs	204
won	965
d	287
“	110
couldn	62
xmen	159
”	127
sheepishly	12
swims	80
enjoys	115
view	657
becoming	656
curmudgeon	6
dory	723
looking	2332
opens	756
features	623
several	2112
thereafter	71
cuteness	21
factor	252
dialed	22
11	381
rather	2093
attempt	1253
invest	34
plight	117
saccharine	20
plausible	121
either	1582
fully	533
aware	443
cartoon	434
petting	25
tank	456
nemo	519
dad	820
telling	1311
clown	103
fish	455
shells	115
happy	2097
adorable	326
taught	317
valuable	95
lesson	248
fantastic	2678
children	2137
lessons	195
ocean	333
octopus	177
hank	190
likeable	147
learned	552
herself	1243
optimism	67
finding	1172
remembering	234
remembers	278
following	966
whale	88
likes	533
marlin	172
kid	2079
barrier	89
reef	18
hide-and-seek	5
migration	11
aimed	195
expected	1406
having	3362
severe	110
entirely	588
plot-driven	14
memory	723
loss	415
california	418
australia	120
anyway	864
basic	372
forgiven	130
implausibilities	17
errors	91
irritating	81
service	473
dull	476
septapus	5
tentacle	26
ended	869
crying	279
five	980
six	584
boring	1494
disappointing	548
service-y	34
eaten	148
audiences	607
dat	48
short	1864
tho	140
paranoid	193
chased	246
glowing	94
squid	103
cry	756
cried	424
calls	1446
ooo-	44
left-oooo-to	46
right-oo-perfect	45
called	1611
spectacular	565
sigourney	79
weaver	97
kept	1130
highlight	282
sia	43
song	1617
bond	3156
aquarium	78
truck	791
drivers	91
hectic	30
chunk	91
nonsense	121
again	6884
pregnant	514
raising	100
live	2172
david	2230
somerset	138
advises	114
sets	1511
insisted	39
partner	600
abortion	125
finally	2692
convinced	379
remorseful	52
dramas	46
fuels	39
drawn	591
entertained	482
events	1293
unfolding	45
remain	343
uncompromising	67
shocking	417
thus	559
satisfying	523
initial	303
vision	681
fincher	399
surrounds	23
hunt	516
serial	406
killer	1722
inspired	645
dante	478
alighieri	11
seven	433
deadly	337
sins	64
divine	179
preach	19
impurity	9
targeting	25
victims	408
torturing	76
pitting	33
underlining	11
se7en	217
typical	636
mouse	228
stronger	276
mills	254
apartment	1224
feet	341
iconic	361
el	234
train	1318
chicago	362
marvin	202
gaye	25
trouble	622
formally	26
viewed	148
punk	134
prints	25
ask	818
interrogate	29
victor	197
hospital	999
doctor	1016
chewed	17
tongue	145
mush	30
ordeal	94
evening	423
tracy	282
requests	114
diner	237
detective	998
develops	288
modern-myth	13
taking	1751
90	637
favorites	594
brutal	637
relentlessly	68
grimy	48
shocker	52
slick	198
gore	861
haunting	305
finale	365
darker	338
kevin	1469
spacey	141
weirdness	31
apart	728
arrive	1052
surprise	1156
clue	266
prior	334
occurring	56
day	4322
contact	330
fbi	608
library	206
borrowed	89
related	168
detectives	172
doe	112
visit	672
hidden	554
development	1077
polished	43
remains	661
tight	180
straying	10
outwards	9
unimportant	43
issues	389
resorting	38
clichs	186
uniquely	53
brad	1057
pitt	821
horrifying	224
home	4428
pulls	827
shooting	792
hits	823
tire	83
iron	951
fear	1335
uncertainty	89
poetic	130
showing	937
grain	13
rarity	37
nowadays	194
directed	1007
skillfully	26
written	1732
andrew	803
walker	125
cop	1085
dogs	663
interact	89
box	2294
disturbing	884
script	2403
superb	1297
counts	144
levels	429
worth	2397
office	3079
building	1324
leaven	76
claims	539
hang	236
quentin	279
believes	587
coincidence	86
purpose	541
cube	368
holloway	65
talks	551
rings	401
broaches	11
glasses	248
jewellery	34
shaken	80
feeling	1551
exposed	243
humanity	690
society	1485
bold	143
admit	852
low	1144
canadian	91
sci-fi	920
viewing	683
knowing	844
watchandvern	45
far	3622
lull	45
middle	935
met	1035
died	1186
testing	70
rooms	125
occupations	8
urges	71
vs	177
humanitarianism	13
conceptual	17
intend	61
lies	436
mystery	729
notch	433
freaky	130
dark	2829
act	1413
firefight	80
gunshots	148
worst	1964
waste	594
amateur	100
farce	148
happens	1120
consist	71
sharlto	57
copley	59
needs	1496
group	2370
contained	117
electrochemical	12
sensor	20
rennes	27
missed	836
instinctive	22
45	130
min	85
enjoyed	3933
equal	231
design	838
loudness	59
explores	101
thoughts	332
instills	12
7/10	120
goofy	353
hilairous	47
deal	1369
drinking	220
linda	302
afar	19
ceremony	159
dual	22
wine	252
cup	198
convention	38
couple	1406
wil	12
spill	61
catches	380
drips	35
bride	164
dress	411
nick	1317
proposes	119
bouquet	20
accepts	187
groom	31
mike	1210
decorated	59
cadillac	17
chases	686
stripping	74
winding	29
basketball	41
court	344
course	2865
advance	219
supposed	1161
various	551
affected	153
worked	688
powerfully	23
trimmed	21
careless	60
frat-boy-like	10
immaturity	34
revolve	22
frivolity	7
chevotarevich	50
christopher	762
walken	325
genuine	362
depiction	213
realistic	1092
environments	91
robert	1503
de	952
niro	367
russian	459
roulette	106
dies	910
encounter	349
spends	193
comments	545
criticize	39
half	1922
miss	1100
1978	239
wet	171
pants	148
reputation	360
undeservedly	51
michael	3479
promise	277
clairton	33
wedding	836
mountains	75
deer	145
hunting	237
expressed	26
theory	157
previously	290
stan	155
cold	687
shoulder	179
socks	19
bullets	225
cpl	54
lots	811
rituals	23
relationships	302
foreshadows	11
relatively	311
unaffected	23
personalities	153
stayed	267
stanley	92
points	847
outstanding	1088
actor	4489
technical	470
deficiencies	4
matters	327
nitpicking	55
compared	618
construction	153
clair	23
jean-claude	129
pistol	333
aims	83
bryan	643
angrily	242
detailing	27
pay	869
expenses	11
tosses	117
onto	680
dining	41
table	440
desk	132
difference	286
weight	278
loaded	195
unloaded	36
shoots	947
isabelle	29
saying	1881
wound	251
quantum	74
solace	75
jason	3079
bourne	1217
confused	542
neeson	376
barrel	31
3/4	36
spy	792
morgue	104
rescues	240
daughter	2033
boat	658
hero	2344
singer	400
undeniably	119
largely	214
brainless	113
exercise	194
grimly	26
professional	250
efficient	117
recovers	125
lavatory	4
tucks	5
waistband	4
casually	128
speaks	347
moving	1129
paris	300
address	204
albanian	8
pimp-house	4
macon	12
naively	13
selling	250
protection	97
anonymity	25
albanians	20
demands	373
saint	137
revenge	1139
buck	186
trend	68
horrible	1092
comparison	411
surprinsingly	15
9	432
rt	199
fastest	114
93	96
minutes	2228
maggie	384
grace	607
poor	1338
emma	443
watson	451
inspector	355
edging	11
ahead	592
jaw-dropping	48
sequences	1086
international	826
trafficking	21
miserable	69
shaky	260
cam	160
direction	1490
pity	326
liam	386
son	2642
nee	56
trailer	1277
gave	1835
tomorrow	425
inherent	94
vice	194
killing	1911
intro	223
vodka	65
martini	43
5.5/10	65
fuck	1236
chews	27
discarded	43
gum	74
coffee	273
shop	306
claim	195
literally	1020
buddy	796
eventually	1337
empire	372
state	654
incredulous	23
walter	477
hobbs	35
thrown	681
security	577
guard	549
sarcastic	200
suggestion	99
gimbel	11
mistaken	154
employee	189
lovely	428
unenthusiastic	5
jovie	37
shocked	473
article	130
bob	1024
newhart	21
elf	366
refreshing	439
ferrell	224
innocence	373
dvd	1270
burps	49
massive	649
snowball	48
park	760
started	1190
eating	391
candy	226
sweets	31
meal	236
clean	479
ensues	159
reluctantly	197
bails	23
pediatrician	1
dna	179
test	522
supporting	2022
relief	476
family-friendly	8
portraying	162
breaks	930
nathan	155
answers	328
emergency	148
hurt	600
ted	206
pick	680
expects	74
perform	358
oral	13
memorable	1251
night	3445
raving	33
bridesmaids	43
all-female	8
show-business	6
sadly	311
women	1049
hangover	272
equivalent	136
sweet	758
held	757
complete	1174
prefer	301
classier	3
president	642
female-driven	10
comedies	699
breakthrough	105
female-centered	10
feminist	24
boot	169
means	798
meghan	14
unapologetically	83
lillian	91
bathroom	651
accident	452
favourite	4062
realizes	1288
amends	39
baking	12
cake	228
appears	1442
doorstep	23
raccoons	4
eat	500
attend	264
intentions	159
decided	521
try	2049
gut	104
correct	341
humorous	438
chuckled	17
involving	522
poop/vomit/farting/burping	12
lame	373
slapstick	357
cheap	545
shots	523
sophisticated	241
classy	101
trashy	156
honestly	1359
drunk	358
airplane	223
moves	673
desperate	324
nudged	23
broken	606
rib	25
begging	93
rated	444
version	1490
spongebob	19
slowly	642
stretched	77
relationship	1389
walks	896
reclusive	15
refusing	95
obsessively	27
megan	119
important	1779
kristen	176
wiig	46
score	1588
progress	104
holes	471
r/movies	11
shitty	261
layman	17
terms	596
whoa	136
willing	461
dome	52
examines	86
wall	1013
ways	1073
staircase	42
exit	147
reaches	272
christof	29
shakespeare	130
eight	252
repeat	175
oscars	212
truman	308
jim	1266
nobody	547
tough	827
ashaming	27
outdated	34
prejudices	22
carrey	417
conquers	30
fears	194
sail	104
storm	462
personal	963
bests	27
relatable	287
lived	460
predictability	44
escaped	501
wanting	457
island	909
revealing	348
beyond	1063
convince	508
stay	1216
within	1144
happily	194
suffering	231
pain	725
plant	151
fair	455
disaster	355
explain	488
saving	413
private	510
thin	340
red	1383
joyless	38
cristof	16
eternal	144
sunshine	196
unassuming	20
provoking	328
totally	2176
underrated	765
sits	271
burbank	18
turman	13
overcome	377
curiosity	106
brought	1410
directly	355
introduces	352
creator	156
nominating	22
moon	397
forget	1132
soundtrack	925
arts	465
sciences	32
realized	462
getting	3018
excuse	230
weaker	149
$	3044
600	27
immediately	989
afterward	176
neighborhood	150
festa	4
vito	289
murders	324
fanucci	18
hallway	102
rejoins	22
four	1465
stoops	15
infant	144
january	82
1959	31
nevada	39
snow-covered	10
lake	475
tahoe	21
compound	116
fleeing	82
cuba	104
hagen	76
roth	114
stroke	41
recovering	81
miami	201
bodyguard	134
fredo	71
hiding	298
informs	402
kay	286
miscarriage	22
distraught	90
furiously	53
flashback	350
1920	6
companion	91
compliment	92
prequel	310
rise	679
decline	46
micheal	164
uncanny	41
deniro	182
pacino	567
corleone	346
clemenza	63
rug	118
earns	53
intercede	2
local	1047
disputes	18
operating	55
storefront	5
genco	8
pura	2
olive	365
oil	281
company	859
abbandando	6
favors	18
others	2372
community	363
threatened	126
eviction	2
intimidates	10
landlord	15
extra	363
weeks	399
ruthless	239
unemotional	10
betray	51
price	452
paid	292
gangster	358
travesty	87
ensemble	318
changed	894
demanded	81
nuclear	350
kills	1775
creepy	1236
guerrillas	27
guests	107
flee	364
refuses	825
pleas	43
brother	1554
scary	2739
hands	1150
less	2197
sixth	159
noise	161
prove	381
sequels	1443
chilling	359
labelled	14
covering	119
stencilling	5
marking	40
van	1090
belonging	26
electric	175
stolen	341
inside	1934
mcc	8
frazier	174
meticulously	78
compensates	20
lack	1053
3d	1260
characterization	156
denzel	286
ambitious	207
policeman	146
achieves	164
level	1178
sidekick	141
chiwetel	60
ejiofor	89
serenity	8
fame	140
frustrated	216
captain	1412
willem	61
defoe	11
sparkling	72
dialog	535
clive	232
owen	334
okay	1238
convincing	795
criminal	451
mastermind	80
wearing	490
mask	477
heist	212
achieve	202
dalton	206
russell	610
smart	1635
ringleader	29
operation	446
robbers	200
clothes	184
painter	23
suits	258
knew	1450
listening	191
device	469
outsmarted	46
recording	145
speech	531
peel-away	4
decal	4
breezy	30
tongue-in-cheek	61
reminiscent	189
sting	59
over-plotted	11
twists	542
turns	2083
thankfully	291
mostly	802
non-expected	9
contrivances	28
abound	32
ie	58
target	360
recommend	1516
town	1645
twist	773
chal	16
chaiyya	64
flick	1480
tv	2700
supremely	33
nonsensical	87
motivation	141
beside	106
establish	42
shown	1043
sitting	632
spike	156
lee	1556
fare	173
versatility	5
chooses	208
macguffin	6
slight	81
significance	89
resolution	112
neat	106
structural	34
trickery	29
flash-forward	5
hinting	18
toward	535
giving	1234
sparingly	19
cleverly	133
highly	997
progressing	23
climax	612
wishing	80
rare	700
stephen	335
sajdak	13
secret	1045
holocaust	24
'how	54
plan	1048
walk	728
soul	600
represents	169
mercy	174
teach	229
putting	394
oneself	50
contends	14
allegiance	23
portion	78
reminded	512
impressionistic	11
sequence	1499
including	1431
bits	283
voice-overs	32
closure	137
satisfaction	81
plain	296
suck	228
presenting	57
objective	59
withhold	5
mention	798
observed	80
theater	1835
parking	215
afterwards	307
spilled	39
lemonade	25
seemed	1319
attentive	23
montages	18
profession	100
took	1603
grew	420
o'brien	57
dealt	197
developed	540
universe	630
jaded	24
aged	155
sean	825
penn	149
scarred	45
memories	557
oppressive	27
upbringing	16
untimely	26
younger	717
yawns	7
uncomfortable	302
fidgeting	13
warmth	100
trace	91
evolution	226
eleven-year-old	17
midwest	24
silence	368
filed	23
hated	471
feared	70
heaven	236
progression	93
evolving	31
wonderful	2108
beautiful	2794
depict	86
spirituality	21
tried	1057
reconcile	202
thank	530
everybody	597
sheesh	12
skip	141
avoid	525
crap	610
flashes	141
mrs.	323
chastain	40
plow	8
distance	255
burke	82
blows	324
along	2505
creatures	509
edward	1277
aline	10
surface	365
orphanage	58
evacuated	78
cars	770
streets	545
occupation	37
began	408
nowhere	413
pounding	44
techno	33
track	669
happening	644
drama	1702
stiff	58
wooden	286
delivery	298
reading	578
cards	137
comprehending	6
lines	1726
delivering	287
adr	28
sounded	214
recorded	75
knocking	254
how-to-be-recognized-as-legit-director	49
direct	331
terrible	1505
alot	258
rotten	288
tomatoes	218
tge	14
ancient	285
christian	286
slater	94
surprised	1584
stereotypes	210
wandering	116
extent	297
ok	1347
fictional	218
miller	729
crossing	150
unbelievable	257
scenarios	65
crap-fest	9
parts	1780
origin	251
stories	946
elaborate	311
shockingly	71
afleck	47
guess	1436
gate	116
hudgens	18
suddenly	1140
supposedly	170
confront	177
care	1810
hit	1583
marks	82
robotic	38
listless	31
automatons	4
whisked	6
series	4624
implausible	111
often	1571
rhyme	8
nine	157
bucks	91
section	224
jedediah	50
octavius	128
cecil	97
together	3367
larry	236
leaders	90
proceed	117
flatten	18
tires	38
valve	14
stiller	312
hey	629
tickets	114
monday	50
funnier	399
anticipated	87
famous	636
*in*	12
situations	602
adam	658
sandler	275
usuaully	14
passive	19
element	550
propelled	32
gus	165
mcphee	14
atilla	14
hun	20
problem	1168
pacific	49
friendly	324
rex	140
fountain	138
ben	1076
disliking	8
easter	54
screams	326
quiet	454
speak	661
guards	452
tablet	52
task	283
civil	176
soldiers	1081
planetarium	12
wing	155
columbus	247
cavemen	14
interest	690
nay-sayers	9
judge	319
previews	181
tut-tut	6
wastes	96
kicking	110
marketing	308
gear	71
t-rex	45
enjoy	2654
delightful	227
let-down	39
notably	111
balked	12
script/quality	12
filming	355
presence	602
insult	110
th	70
producers	528
ashamed	185
hundreds	223
thousands	277
loyal	197
waiting	862
inspiring	200
hobby	48
prodigious	5
100+	9
aloud	33
pee	66
wee	40
herman	12
horror	6477
demise	90
public	612
eye	868
potential	600
game	2042
awful	996
yourself	635
warned	227
amnesiac	25
identifies	64
perpetrator	24
former	918
universal	501
soldier	889
unisol	129
luc	321
deveraux	245
adversary	78
clone	209
nemesis	187
negotiates	36
magnus	23
injects	91
serum	53
frees	141
control	1125
gorman	44
activates	90
sleeper	75
agent	1258
cloned	6
generation	649
unisols	67
regeneration	57
brothel	18
props	87
35	41
million	824
dollars	358
taco	40
abyssmal	7
prized	17
artifact	47
fell	632
cracker	38
armor	161
backgrounds	46
straight	779
bargain	42
bin	210
store	876
fantasy	1357
camcorders	9
across	1311
globe	77
yards	41
remotely	215
entire	2575
proceeding	21
demadar	8
awakens	167
coma	75
brutally	268
murdered	457
invasion	243
shoot	720
notable	122
otherwise	471
poorly	367
received	520
appearances	59
richard	1184
parody	216
program	351
maze	147
baker	213
journeys	64
north	364
patch	100
terence	164
restore	92
pixie	64
dust	106
4.9	2
date	948
3yo	5
curious	226
tb1	5
satisfactory	34
dozen	239
grabbed	92
nmt	4
media	529
safety	352
message	1380
tb	10
marginal	11
promoted	108
tink	4
fairies	11
tinker	134
bell	347
ready	690
journey	856
fairy	527
gary	291
ok.	131
color	362
terrence	82
cap	173
suffer	222
topical	191
assyrians	134
mentioned	482
depicted	389
crappy	259
excited	759
tree	670
multiple	519
wondering	258
wo	1632
v	428
beneath	379
bullet-proof	8
creedy	26
wizardry	43
sounds	963
matrix	384
-style	19
ripoff	72
biggest	843
science	1298
fiction	1509
creation	311
examination	64
stage	540
disease	104
famine	69
exploited	71
weapon	550
method	54
centuries	111
masked	113
waits	154
shadows	137
carry	308
sentence	141
crazier	59
relevant	294
unashamedly	26
5th	108
november	190
fawkes	59
holding	618
'meh	15
graphic	298
novel	786
protagonist	305
code	370
freedom	349
fighter	326
evey	66
sacrifices	183
neck	390
swiftly	59
staggering	44
tunnel	289
removes	95
large	1034
metal	394
chest	476
plate	97
immediate	69
continues	938
bleed	45
profusely	6
wounds	211
hoped	137
gripping	328
heartbreaking	175
moore	369
exact	236
elements	807
subplots	126
removed	188
nuanced	67
anything	3261
suffice	46
anarchist	13
voiced	393
hugo	117
weaving	100
natalie	387
portman	202
expose	91
corruption	103
9/11	89
silly	938
lair	169
dominoes	13
cause	1064
reminds	614
rorschach	41
watchmen	94
normally	296
source	593
deals	186
shitting	56
told	1629
collapsing	67
'is	18
finished	291
confessing	38
fallen	307
outbursts	25
spectacularly	63
filmed	476
choreographed	75
maturity	66
restraint	36
wachowskis	4
mctiegue	10
self	429
conscious	22
slow-motion	14
overtakes	9
natural	505
breathing	98
cinematographer	131
adrian	171
biddle	16
dedicated	139
oscar-nominated	27
dario	15
marianelli	9
accompaniment	8
astonishing	169
terrifying	745
climatic	88
trafalgar	10
solid	1340
rad	36
bloody	440
masterpiece	1556
generally	391
sad	1335
living	1130
existence	191
barrage	54
composes	8
rushes	273
knives	115
reload	29
unlike	666
allows	364
focus	721
result	763
tense	435
1984	146
useful	137
gain	247
perspective	544
shave	33
vagina	64
greats	48
80s	225
hesitant	79
diana	55
rigg	78
passed	345
sign	395
third	1124
omen	107
wildest	36
nightmares	203
--	2866
imagination	542
thurman	278
fiennes	107
macnee	19
woefully	48
miscast	30
avengers	246
summer	1366
pared-down	6
rational	38
double	522
peel	34
sensually	11
uma	108
man/tony	7
stark	682
badass	299
hulk	281
steed	62
assists	14
changing	249
boots	90
throws	687
loki	51
rag	39
doll	434
punched	47
thor	93
improved	135
strongest	125
frisbee	11
ultron	54
weathering	13
spader	27
f****	27
lizard	37
king	1856
please	928
heimdall	33
cockpit	54
quintet	41
unintentionally	78
coulson	45
intel	41
shield	152
bombarding	32
von	103
strucker	31
base	532
wear	163
adidas	30
describes	132
picked	296
mjolnir	56
applause	131
worthy	662
nooo	67
quicksilver	102
fix	252
tractor	74
announced	184
spies	162
thrilled	92
selection	28
uncle	432
collectively	60
project	523
cheeky	95
campy	178
form	1100
entendre	31
somewhere	396
fraser	92
evelyn	83
o'connell	20
rachel	715
weisz	188
exploring	137
pyramid	45
egyptian	9
thebes	6
alex	1553
collect	154
bracelet	49
anubis	49
trap	439
rick	440
narrowly	70
pyrmaid	5
floods	23
encounters	414
looters	24
walls	226
london	554
addition	534
scorpion	64
effort	657
screentime	23
tangent	43
favour	43
rivalry	77
imhotep	72
originally	232
mistook	21
reincarnated	7
needed	1091
differently	135
tangents	15
sensibility	115
omnipresent	19
nonstop	25
clank	7
swank	17
mummy	224
mystically	4
provides	473
directions	186
oasis	33
ahm	8
shere	65
eighth	21
rays	23
sun	403
shine	178
army	970
reawaken	1
intended	314
fill	256
gaps	54
attacked	801
hollow	249
lightweight	69
entertainment—not	16
unpleasant	106
definitive	112
action/adventure	71
agreed	704
picking	112
1933	5
brendan	286
substantial	95
running	1384
length	355
oded	23
fehr	32
bang-up	5
providing	145
1999,2001,2008	7
spookyverse	8
huh	172
jenny	563
meatloaf	36
sofia	44
boutella	17
spelling	104
kurtzman	29
considered	407
entertain	317
arnold	235
vosloo	40
chosen	259
roles	1056
churned	12
satiate	3
greedy	83
money-machine	3
cut	1488
mallory	70
breasts	26
slashing	17
knife	502
mickey	469
attacks	648
killers	204
'why	24
cnn	30
bronco	27
cruising	30
'natural	19
culture-question	4
crashes	315
90+	6
cruise	1041
questions	691
raises	126
*just*	7
self-effacing	7
critical	210
intention	182
remove	206
field	442
criticism	188
seduced	54
knox	92
woodly	10
harrelson	56
gunfight	63
scagnetti	8
unless	301
surrenders	38
despise	50
wayne	295
gale	195
downey	272
jnr	9
accurately	92
portrays	406
false	193
hysteria	26
machismo	17
tabloid	18
figures	274
geraldo	72
riviera	26
record	437
tea	151
visually	582
beaten	361
vengeful	105
policemen	46
iiithe	1
oprah	26
windfrey	5
characterisation	83
archetypal	19
figurehead	11
lives	1564
newsrooms	5
mobile	67
phones	94
smoking	275
cigarettes	54
deceitful	23
writers	696
60	240
paranoia	146
everywhere	247
realising	73
10,000	49
attached	264
object	173
'boom	4
corporations	46
basically	1043
bludgeons	11
nbk	28
*is*	43
ultra	57
indulgent	97
generated	93
release	953
criticizing	21
abstract	61
observation	70
tazers	1
magazines	11
right-wing	11
televangelists	2
exist	378
relates	50
'like	13
culturally	73
significant	312
proposing	11
anti-violence	11
agenda	57
rape-revenge	9
fantasies	25
nation	139
rely	160
blackbeard	78
captured	824
pearl	114
forcing	280
barbossa	125
amputate	6
leg	465
defeat	358
chalices	18
nearby	596
spanish	159
camp	550
syrena	18
philip	221
tricked	65
shedding	18
tear	198
collects	35
sparrow	338
intelligently	21
subliminal	28
avatar	215
blair	157
witch	408
recent	789
production	949
artifice	13
the-artifice	11
com	147
pirates	426
writing	1283
click	29
muchness	17
clothesline	19
dangle	21
obligatory	82
incoherent	86
crammed	24
pointless	454
installments	91
necessity	74
streamlining	9
bloated	81
chalice	8
containing	173
mermaid	148
extended	137
drained	57
intends	224
circumvent	4
fated	7
fatal	165
one-legged	5
whitecap	5
traps	297
swift	46
sam	2730
claflin	7
captive	128
missionary	15
bizarre	355
nail	235
biting	104
healed	53
names	449
strid	3
bergs-frisbey	3
sends	571
retrieve	308
privilege	77
capitan	15
advanced	263
screening	308
johnny	1200
depp	370
pirate	263
action-packed	147
tale	1019
truth	1098
betrayal	299
youth	386
crosses	158
paths	70
penelope	64
cruz	64
sure	3778
loveor	6
con	75
artist	431
fabled	42
gibbs	59
reunited	158
helping	372
confiscated	53
compass	34
forces	690
aboard	253
queen	879
anne	531
ship	1823
formidable	65
ian	504
mcshane	32
brilliance	129
frustratingly	82
mermaids	58
showed	989
melman	83
situation	859
hopeless	79
digs	26
grave	340
beach	429
extending	15
testament	84
sand	122
informing	47
wave	140
rolling	237
grandkids	7
families	251
technically	228
'uneven	3
places	489
*that*	9
needlessly	48
negative	477
feedback	23
zebra	101
zoo	244
julien	98
according	1768
erases	3
bottom	362
pertained	2
inheritance	21
marty	447
meh	291
28	312
15	477
respek	77
mantzoukas	188
listen	426
podcast	92
wait	1610
decent	1376
adults	816
madagascar	283
ride	1331
listed	181
jeffrey	172
characterwheaties	99
today	1478
anxiety	136
unique	1132
quirky	286
i.	500
e.	614
nonchalantly	23
subway	143
accounts	90
shrek	1565
8.25	24
silent	537
paused	67
laughter	440
presentation	207
quick-paced	7
bright	413
ears	123
poll	127
ten	1085
democracy	113
admittedly	213
drinks	260
deep	1304
hillarious	125
reccomend	70
episode	1082
loses	388
intending	77
swim	147
gloria	95
admire	91
contents	91
chucky	791
bursts	150
reprimands	27
tyler	589
commiting	3
federal	76
offense	23
thwarted	17
possessing	38
barclay	90
mid-sentence	1
inhabits	18
revealed	864
identity	460
hence	108
justin	105
whalin	5
teenager	199
military	656
change	1529
scenery	286
kinds	114
options	39
murderous	102
paintball	28
guns	525
ammo	73
reviewers	239
complain	203
gorefests	5
scariness	21
complement	51
tubes	46
pals	68
ceo	66
paralyzes	29
dart	40
spine	130
yo-yo	28
piano	181
wire	194
80's/early	23
comedic	525
anti-hero	140
rooting	157
candidate	74
befriends	180
malevolent	32
hide	479
unknowingly	44
ritual	141
interrupted	163
cochran	12
fellow	426
major	1114
enter	472
department	427
inventory	6
upcoming	156
annual	28
plastic	278
star	3667
brushed	10
aside	513
favor	187
desire	285
swap	26
souls	92
someone	2152
dimensional	69
uninteresting	133
vincent	990
became	971
shameful	18
hokey	59
entry	343
certainly	1532
caliber	110
amusing	387
dourif	74
sullivan	435
root	211
force	1077
pilot	304
stationed	45
japan	226
sgt	223
clark	622
replies	221
cheer	91
disappointed	1136
requesting	21
deliver	470
package	198
addressed	70
errand	16
heads	584
en	143
destination	604
stairwell	67
chasing	289
skellington	27
bodycount	54
rats	130
folks	271
*not*	53
freaked	72
commentary	499
audio	76
juvenile	101
cadet	30
visits	370
mailing	6
sargeant	3
inquiring	19
notifications	1
sheep	70
wish	1446
toned	79
voodoo	89
angle	205
charles	631
shore	81
stabbed	241
groin	13
spear	69
rain	447
terri	13
bicycle	35
rammed	39
tina	394
jimmy	321
celebrate	153
carefree	25
bottle	75
reasons	648
personality	630
f13s	4
deaths	512
briskly	36
keeps	1245
disposable	27
count	302
balance	302
teenage	596
fodder	35
inclusion	28
seasoned	78
backpacker	5
touch	628
sh*t	32
kicked	193
tommy	941
arc	330
friday	948
13th	598
upstairs	221
window	937
landing	173
stoned	74
watches	400
vintage	63
1910s	2
stag	28
projector	27
kitchen	247
iv	365
predecessors	131
likable	454
relate	698
crispin	16
glover	110
horny	18
unmatched	7
lead	1634
girl	3342
jarvis	45
darn	133
nudity	248
the-	2
chapter	679
appeared	500
alfred	239
hitchcock	304
doug	284
sara	214
shower	262
tile	1
unfortunately	674
climactic	159
linger	12
ii	1146
generic	218
male	905
iii	618
clunky	17
glovers	22
ftmfw	13
donation	11
sliced	27
coroner	71
throat	178
searching	203
corkscrew	4
emerges	172
drives	649
meat	85
cleaver	44
impaled	99
raft	221
nude	94
swimming	166
yep	309
proves	520
mistake	470
piranha	186
devour	26
travis	50
cuffed	9
pole	67
ashley	176
roof	556
busey	14
opening	1644
wasted	331
cow	85
farts	48
fire	1428
ving	76
rhames	81
pathetic	271
positive	461
hasselfhoff	2
chuckle	128
gorgeous	535
1/2	69
generous	78
atrocity	54
b-movie	118
afternoon	173
stump	22
smashes	79
glass	496
sinks	71
13	324
wrote	516
annoyed	90
suppose	342
payoff	79
55	18
presents	282
underwhelming	56
sucks	262
extreme	345
mayhem	237
creature	642
lifeless	161
business	953
screaming	406
suspend	51
disbelief	133
fishy	92
adding	129
thats	510
revolutionary	266
slipped	79
devoured	34
hanson	14
possessed	410
cindy	183
brenda	131
theo	121
charlie	802
angels	250
bait	65
lure	119
kane	430
ghost	798
ultimately	674
months	667
parrot	29
despises	8
mood	457
harsh	227
bashing	4
anna	500
farris	4
walked	470
apparition	63
defeated	184
ed	743
interviews	149
notice	849
figure	847
priest	323
shorty	64
teens	196
equipped	25
technological	46
devices	220
dwight	55
serve	317
harass	9
injure	11
spectral	6
pursued	115
undead	97
skeleton	57
rips	58
bones	154
paper	407
share	498
laughs	1622
butler	84
gross	338
sick	340
crude	316
conjuring	490
premier	81
classics	277
scare	369
emotionally	462
exhausted	146
hindu	62
bought	263
bible	172
gasped	77
lorraine	266
breakfast	189
tori	43
ruined	327
moviegoers	98
80	591
loudly	101
disfigured	50
seals	53
exits	49
manor	17
prevent	344
surviving	202
escaping	260
realizing	400
dresser	55
moved	471
busted	78
tidbit	40
hired	255
exorcist	666
bless	80
nuns	42
amityville	101
rumoured	39
trust	469
ons	2
tim	970
curry	22
towards	1174
claps	37
wan	471
usually	872
homework	57
9:30	3
pm	23
notes	239
sexual	622
sandy	456
kissing	94
undressing	8
knocks	349
grasp	121
manchester	62
clumsy	154
punches	242
humans	831
dynamics	90
strangers	132
knocked	398
randi	59
joe	1121
funeral	351
wrenching	116
toll	78
poignant	280
grief	136
trauma	98
burned	154
lees	8
chicken	226
freezer	17
activity	299
ex-wife	67
condolences	4
bore	115
melancholy	107
gasp	29
unresolved	13
godspell	15
spot	817
chandler	92
casey	299
affleck	247
'please	21
stopping	122
haunts	85
terribly	247
overrated	293
lucas	214
hedges	38
freezer/panic	30
fucked	211
future	2074
whenever	339
believed	269
emotion	679
**melancholy	19
sea**	17
fits	238
glove	53
janitor	55
boston	247
nephew	113
strangely	217
raw	229
sucker	26
spent	522
causes	423
fall	1016
astounded	17
lacks	318
elizabeth	503
banks	123
effie	3
trinket	3
absurdity	51
capitol	124
donald	58
sutherland	130
snow	568
lawrence	692
adequate	135
katniss	445
hutcherson	12
peeta	238
twilight	317
harry	4102
potter	925
space	1252
enthralling	55
intelligence	590
pulse-racing	8
value	366
rough	284
handheld	27
camerawork	69
blood-flecked	9
combat	431
arena	117
[	2080
]	2083
bland	357
dilutes	13
venom	94
climb	200
grab	172
bow	98
arrows	15
hallucinate	12
cruel	200
dictatorship	3
poverty	104
unequal	2
distribution	25
wealth	159
affects	65
panem	27
wealthy	145
destitute	6
districts	31
regard	171
district	281
hunger	334
games	979
wholly	67
embraced-	14
celebrated-	14
residents	161
tributes	87
enemies	284
enthusiasm	58
trilogy	943
progresses	169
compelling	527
madness	127
futility	42
reserved	96
thrust	96
offensive	141
storyline	992
