i	177962
thought	7064
the	486205
acting	4537
was	148371
great	22508
but	46750
movie	90065
over-long	20
and	195712
needed	1019
a	193962
better	7653
ending	3215
.	486552
just	20212
watched	2076
it	147686
loved	6085
!	30492
my	49657
understanding	309
is	123369
that	89123
's	80351
very	17001
good	24729
oh	3804
,	301613
are	28242
you	71021
fo	21
'	9988
real	4497
?	62754
watchable	253
for	51121
fans	1693
of	162406
genre	1826
agree	3704
one	62315
gems	38
we	10332
get	9825
each	2580
year	4031
would	11066
have	25264
been	8414
impossible	760
this	71802
or	11873
any	6500
to	161206
be	28170
as	47944
sweet	808
jessica	368
alba	151
does	9931
n't	35800
keep	1938
from	24110
trying	2353
than	13228
fish	330
tank	305
in	139203
top	3239
10	1733
sure	3312
see	12983
those	4317
other	8915
movies	15374
watch	8500
anime	63
not	32732
whatever	570
honey	347
never	6971
seen	7907
{	643
}	724
an	26503
attractive	206
energetic	85
dance	1115
numbers	199
provide	326
some	13122
lift	105
corny	427
formulaic	145
brings	779
out	19427
wholesome	81
affirmative	20
side	1615
hip-hop	49
aesthetic	79
without	3647
being	7215
overly	213
preachy	22
tend	340
with	51090
nyt	327
review	1211
which	44332
says	2502
:	13233
pressuring	10
take	4587
up	16493
teaching	85
ballet	42
classes	77
her	21335
parents	1359
refuse	113
help	2217
new	6307
studio	471
gets	4305
bank	402
loan	22
puts	569
down	5213
deposit	28
meanwhile	569
pitches	15
idea	1267
ellis	30
ginuwine	10
video	877
using	1015
kids	2737
she	19513
teaches	120
at	27964
centre	105
back	7934
dancers	37
like	30202
urban	168
pied	2
piper	36
gina	56
25th	67
birthday	306
comes	2672
makes	5440
plans	534
atlantic	24
city	1519
convinces	230
make	7684
appearance	407
black	1997
white	1238
party	1038
instead	1822
where	10635
he	54305
subsequently	86
drunken	108
pass	266
refuses	466
his	42648
advances	64
slaps	34
him	17974
on	37205
face	2479
michael	2534
begins	1519
major	753
outburst	5
leaves	1368
background	550
impressed	652
hires	75
katrina	175
fires	155
balls	261
business	769
installs	3
place	2242
friendship	254
although	1865
strained	35
improves	222
helps	559
realise	179
can	11766
still	8817
dreams	365
come	3617
true	4383
struggles	211
pay	676
payment	15
eventually	840
raise	177
revenue	24
holds	616
benefit	122
abandoned	255
church	324
will	12724
torn	104
event	334
spends	127
<eor>	54558
love	10070
part	6761
when	23412
what	36728
your	12480
favorite	38371
who	22996
character	46205
ofcourse	30
yeah	4076
same	4670
definitely	3921
ice	942
age	1341
3	2615
delivers	782
goods	68
appeals	34
grown-ups	22
alike	183
return	1316
family	4291
films	8803
joyous	79
delight	358
liked	33002
all	25455
fighting	936
big	3258
dinosaur	97
sid	169
think	44965
really	18488
funny	9650
do	42164
remember	21874
came	2388
eggs	96
much	11349
more	16853
emphasis	115
action	9470
nicely	345
crafted	406
fast-paced	144
sequel	4045
film	46375
animation	1444
art	1064
seuss-imaginative	16
flatness	16
story	12487
indifferent	57
voicework	16
obvious	684
about	26901
characters	10162
them	9897
looks	1969
after	9353
hatch	33
into	12568
baby	1484
tyrannosaurus	4
next	2330
morning	520
tries	1848
best	23290
three	2679
dinosaurs	174
their	11294
rambunctious	32
behavior	254
scares	655
away	3919
animals	516
young	2911
ruins	121
playground	131
manny	73
built	374
ellies	1
female	1273
momma	11
whose	674
stole	498
soon	1010
returns	1473
carries	267
both	3945
underground	222
diego	175
pursuit	146
ellie	39
crash	353
eddie	518
(	25335
seann	6
william	737
scott	869
josh	407
peck	164
)	25829
follow	973
well	12229
discover	644
icy	29
cavern	84
leads	804
vast	127
jungle	355
populated	79
by	26433
extinct	16
here	3940
ankylosaurus	1
threatens	274
herd	93
despite	1589
diegos	1
efforts	191
fend	26
off	6926
;	6847
they	30645
saved	860
further	660
crowd	279
angry	532
reptiles	3
insane	300
one-eyed	35
weasel	3
named	982
buckminster	1
buck	127
simon	167
pegg	21
has	20270
living	781
time	16016
chasing	200
rudy	28
huge	1450
albino	44
baryonyx	1
intending	32
avenge	17
eye	677
lost	2060
agrees	346
lead	1260
through	5907
jungles	6
perils	27
lava	46
falls	985
taken	1449
babies	188
adopts	21
apparently	437
finds	2003
call	1298
eggbert	2
shelly	8
yoko	26
find	4893
underneath	139
world	4652
lives	1051
land	355
filled	758
enormous	164
sometimes	1192
menacing	222
our	2292
friends	2151
need	2103
cross	380
order	1132
rescue	559
dawn	314
cute	1085
insulting	76
visuals	640
stunning	786
if	13465
forgive	132
historical	205
loophole	11
there	16124
were	13118
no	11782
during	2773
actually	5220
quite	3313
add	719
lot	5395
plot	5764
cool	2252
nice	1961
sense	2123
adventure	1513
throughout	1979
somewhat	660
missing	910
opinion	3796
previous	1305
installment	672
adds	521
fun	6750
thrilling	993
experience	1392
-	7897
alongside	187
jokes	1046
general	981
atmosphere	691
sum	191
things	3341
above	761
average	786
animated	1899
'll	3050
appeal	310
gave	1810
9	349
yes	5527
shit	1887
''	31649
nature	622
recruiting	31
stupid	1204
teenagers	226
thanks	926
posting	80
interesting	3683
know	7999
how	16659
actual	626
vet	46
feels	1450
leading	653
contender	88
academy	1163
awards	7714
uses	1033
barely	446
perceptible	18
ringing	32
tinnitus	18
amp	24
tension	948
confronts	424
fact	2796
men	2129
often	1430
pleasure	337
war	2710
totally	2014
immersive	46
off-the-charts	20
high-anxiety	20
beginning	2093
end	7565
its	10728
fuzzy	31
hardly	334
original	5987
psychology	62
signs	189
artificially	40
straining	39
depth	825
sergeant	168
first	15184
class	839
james	2277
because	21662
cliche	145
jeremy	303
renner	203
second	2494
tour	310
becomes	1441
too	10551
bored	433
civillian	30
life	7031
relaxing	36
bunk	24
main	2937
pulling	231
bombs	121
ground	531
done	3551
enjoyable	2109
particularly	587
rewatchable	58
suspenseful	588
packed	627
lieutenant	203
colonel	272
john	3466
cambridge	17
die	1519
happened	2269
psychiatrist	66
type	822
cell	214
phone	696
enemy	475
taut	72
thriller	1694
once	2416
subject	341
matter	893
itself	1455
work	3796
bomb	665
expert	167
possibly	718
most	13761
nerve-racking	4
jobs	205
planet	1310
yields	14
suspense	1352
bigelow	55
manages	1051
squeeze	23
every	5816
bit	2798
premise	442
me	17846
apolitical	2
though	5621
set	2262
iraq	104
distinguished	32
iraq-themed	2
concentrates	23
job	3697
political	362
environment	77
seemed	1145
backdrop	160
hurt	497
locker	150
preach	22
specifically	220
deeply	465
emotional	1464
depicting	102
thoroughly	605
disturbed	85
individual	299
hell	1430
gives	2050
incredibly	925
powerful	1201
performance	3930
eod	5
officer	490
completely	1859
hooked	95
adrenaline	157
stemming	7
everyday	177
close	1031
shaves	8
death	2783
aspects	395
film-making	134
top-notch	94
brilliantly	573
subversive	129
screenplay	883
vivid	174
cinematography	1153
masterful	228
directing	795
perfectly	1084
paced	356
editing	723
storytelling	393
filmmakers	449
wisely	57
break	695
traditional	171
hollywood	1664
narrative	439
techniques	95
clear	748
antagonist	45
rising	141
development	929
climax	590
yet	3414
tense	417
've	6197
years	4155
while	6672
making	2375
subtle	698
statement	169
addiction	132
kudos	136
everyone	4016
involved	729
master	608
filmmaker	188
beckham	4
hustle	11
amused	56
tells	3215
money	2555
able	1917
block	194
shot	2132
makeshift	32
goal	57
area	401
blocks	56
buy	554
another	4219
mildly	75
threatening	244
defective	1
team	1473
goes	3690
desert	226
detonate	38
explosives	102
collected	33
missions	56
prepare	238
explode	178
stops	420
sanborn	14
briefly	204
drive	633
blast	298
zone	244
gloves	21
left	2147
gone	1195
eldridge	13
dangerous	471
easy	1055
``	32306
frag	1
exploding	147
claiming	131
accidental	58
seems	2765
pretty	5549
intent	125
doing	1492
so	25217
heading	135
sees	1363
two	6725
suvs	1
parked	26
route	137
approach	400
occupants	48
standing	350
around	3524
threat	345
near	1292
vehicles	119
quickly	1016
obey	18
dropping	132
weapons	350
reveals	791
himself	3609
british	650
commando	5
unit	213
relaxes	14
intense	1102
glad	780
compromising	18
pure	770
quality	1111
cinematic	755
thinking	1445
man	7575
actioner	22
shattering	50
going	4944
'd	2471
give	3211
rank	167
spider-man	714
now	5250
#	893
1	1154
2	5019
homecoming	84
4	1138
5	1329
amazing	4444
6	556
note	675
awesome	3173
after-credits	55
scene	17646
welcome	602
reckless	121
abandon	85
granite	35
washington	298
monument	38
crystal	230
crazy	1122
attention	1160
detail	554
else	1952
already	1452
said	2462
...	18015
ca	4358
over	6177
'm	5740
gon	735
na	891
kill	2537
dead	2479
line	2305
post	578
credits	941
then	7837
shows	2027
sony	28
colombia	41
house	3136
logo	68
spidey	77
mcu	76
consistently	278
moments	2138
dean	144
gordon	420
frank	1356
played	4120
farrell	181
hysterical	206
old	3998
heart	2123
attack	788
ky	31
jelly	35
wrestling	55
match	434
debate	112
carville	49
mock	56
trance	65
long-winded	25
coherent	140
answer	435
question	733
government	489
involvement	177
biotechnology	24
innovation	62
mr.	1362
concedes	27
arguement	21
did	19726
funniest	1567
ever	8440
made	10573
laughed	639
hard	2520
heard	1254
bad	7741
reviews	1301
believe	2607
people	8581
copies	56
taped	28
godawful	74
jennifer	428
aniston	107
debacle	10
picture	2434
perfect	3589
only	10467
explanation	266
seriously	1149
school	1871
scenes	6411
history	1408
mandatory	47
greatest	1952
created	958
go	6239
rent	232
borrow	35
steal	400
somehow	676
10/10	483
mitch	177
dubbed	92
godfather	517
friend	1707
haha	627
annie	608
bus	784
jumped	264
gap	99
bridge	474
jack	3342
trolley	64
cart	129
speeding	110
could	8360
diffuse	64
exciting	1337
concept	515
alright	314
doubt	1016
hold	659
howard	358
payne	134
blown	228
entering	101
home	2934
bomber	36
say	5464
bitch	293
wanted	2202
aaron	318
paul	1003
fit	555
role	3217
casting	698
imo	535
utterly	477
ridiculous	653
cheesy	780
dialogue	2123
had	12979
watching	3889
'turn	57
brain	565
usual	783
rush	481
keanu	242
drove	141
asked	518
driver	571
open	959
door	1051
charachter	274
travern	47
reacted	88
car	3034
insured	51
use	1914
rock-'em	53
sock-'em	53
past	1805
25	363
500	165
calm	331
under	1548
pressure	138
traven	58
reeves	216
suprised	24
speed	454
runaway	42
success	698
1994	131
block-buster	23
word	1123
critically	58
speaking	349
excellent	3575
motion	1114
deals	181
lapd	94
swat	145
playing	1810
deadly	262
game	1562
cat-and-mouse	24
crazed	71
ex-cop	20
dennis	177
hopper	171
blowing	232
high-rise	39
building	774
obstacle	49
rigged	72
drops	251
below	221
50	425
miles	364
per	153
hour	1020
sandra	422
bullock	431
star-making	21
plays	1487
unlucky	30
passenger	50
center	398
forced	834
navigator	43
accidently	46
thing	4069
non-stop	211
thrills	366
chills	191
spills	102
however	2982
complex	718
probably	3010
should	5577
garnered	56
oscar	1065
nomination	112
spite	123
stars	911
hilarious-	23
simply	1751
brilliant	2268
stoner	109
comedy	5045
satire	595
canon	127
hilarious	2722
everything	3178
dude	557
harold	692
bag	396
weed	85
police	2234
station	571
neil	336
patrick	478
harris	344
always	4599
turned	1192
long	3549
classic	3999
finally	2267
castle	300
director	3701
danny	1086
leiner	6
'dude	6
exploits	36
possible	798
ethnic	38
stereotype	15
zeal	6
equaled	26
'bad	42
santa	232
decimating	6
christmas	881
formula	277
're	4498
getting	2550
elevator	368
maria	144
kumar	544
awkward	453
start	1611
guts	306
ends	993
timing	199
amsterdam	155
days	1385
rides	207
meets	1275
asks	1374
touched	186
penis	67
reports	77
hot	635
chick	307
kiss	372
talks	374
&	2445
escape	1893
guantanamo	78
bay	343
picks	260
last	4276
remake	1058
'starsky	5
hutch	5
indeed	975
sunday	122
contrast	162
pop-cult	5
own	3240
expense	47
something	4456
akin	43
enjoying	154
articles	51
'playboy	5
even	10134
reason	2054
buying	112
mags	11
giant	872
leap	113
joker	665
harley	78
quinn	183
acted	886
demented	84
comic	2000
book	3643
sex	1172
went	2373
beating	228
guys	1654
margot	46
robbie	308
outfit	46
before	5588
mission	869
vat	26
gang	643
starts	1401
resurrected	32
troops	150
racing	215
road	839
anything	2696
villians	15
probbaly	4
walk	497
showing	621
mediocre	313
normally	235
enjoyed	3949
intriguing	402
lol	892
benefitted	18
smaller	134
budget	925
realize	872
guardians	86
galaxy	153
jesus	311
christ	161
cara	16
delevingne	14
twirling	13
fucking	1748
looked	988
hula	17
dancing	921
leto	14
channel	120
nicholson	299
ledger	97
ayers	3
franco	195
'spring	5
breakers	17
am	2760
stoned	58
summary	112
half	1618
shitty	269
cat	578
suicide	372
squad	315
worse	703
batman	1498
v.	121
superman	1625
these	3680
ratings	162
exasperatingly	44
marketing	285
bunch	599
god	1753
damned	115
miracle	166
workers	92
custom	26
imax	182
intro	205
wrong	2018
got	5752
weirder	68
read	2155
why	6894
kevin	1318
spacey	135
becoming	500
easily	1201
jai	106
courtney	102
boomerang	55
bar	581
symbolically	34
enchantress	21
called	1241
hand	1329
reaches	183
bodies	267
flip	37
transition	86
critics	2104
absolutely	2640
horrific	195
times	3429
performances	2199
particular	591
include	278
details	460
overall	2212
conclusion	530
difficult	647
fairly	576
spoiler	331
free	891
may	2795
become	1993
guilty	236
viewer	575
subpar	35
hope	1279
faults	51
nonetheless	236
stop	1569
direction	1156
mess	426
common	245
complaint	110
defied	75
logic	176
trivial	47
sub-plot	37
due	788
amount	750
runs	1039
similar	3943
problem	951
feel	4738
compensated	21
satisfy	114
sake	231
whole	3480
nothing	3069
explained	266
want	4037
confusing	415
blend	313
predictable	752
unclear	20
found	3541
myself	1200
constantly	437
asking	493
do____	1
enough	3002
screen	2684
members	484
rest	1396
deadshot	3
fleshed	75
feeble	17
attempts	812
dimension	100
complexity	161
fails	341
flashbacks	274
random	208
monologues	42
elicit	11
sort	890
empathy	79
caring	181
example	809
point	2562
pacing	319
flesh	109
failed	269
also	8960
way	9805
hours	1076
30	619
minute	428
jump	1110
aron	72
spend	280
ralston	59
cuts	366
hallucinates	21
given	1278
limited	242
setting	725
mobility	9
escapes	577
lifted	89
boulder	27
reminder	62
ima	5
finish	518
personally	560
itt	86
knows	1083
tom	1946
brokaw	10
127	24
arm	436
stuck	557
courage	170
must	2994
commentator	7
keeps	934
talking	1259
annoying	566
let	2415
us	3573
hear	865
talk	1079
alone	1278
beat	520
wife	1608
@	20
1:20	9
holy	454
voiceover	22
guy	3372
unforgettable	307
boyle	140
right	5763
arms	363
weird	999
triumph	150
moral	598
hiking	18
bring	996
sharpened	16
bonesaw	11
anaesthetic	11
cutting	161
nerve	95
body	1466
collapse	70
turnaquet	11
properly	115
cut	1290
position	240
threw	175
cheap	418
chinesium	11
fake	582
leatherman	11
replaced	265
ya	288
logistical	9
ideas	451
stand	1051
odd	343
insects	29
inhabit	17
surroundings	23
cgi'ed	1
look	3421
visibly	25
throw	316
tunes	19
try	1552
convey	127
emotions	718
strings	84
least	2133
handful	131
elements	617
slightly	638
less	1817
extra	351
steps	283
pristine	3
release	784
audiences	533
everywhere	209
opportunity	384
centred	2
incredible	1641
legendary	147
bare	40
soul	459
on-screen	89
practically	204
cleansing	6
high	2133
hopes	131
smile	266
authentically	8
merely	237
punctuated	1
amongst	165
sea	299
filth	30
stands	650
9.5/10	50
rating	409
toy	790
damn	1255
seeing	2526
closing	209
style	1353
disney	1922
razzle-dazzle	33
technique	153
unusual	244
camera	1172
loops	40
zooms	81
dizzying	71
fashion	250
takes	2882
breath	339
inventive	298
1995	280
all-time	345
influential	92
visual	1187
effects	3357
100	468
american	2556
woody	860
felt	3010
betrayed	171
andy	1152
buzz	552
overcame	94
since	2901
leader	607
'person	39
slink	41
alive	875
bed	556
toys	493
rebelled	30
against	1577
coming	1362
front	1131
pizza	85
clever	1650
name	2996
restaurant	354
evil	2017
neighbor	106
boy	1618
wakes	368
strapped	82
rocket	235
yard	109
working	743
ominous	84
empty	366
water	1019
jug	2
newscaster-style	1
narration	73
preparations	18
approaching	163
launch	161
pleads	84
mutant	201
hesitantly	27
join	510
none	1040
outlines	36
plan	711
assigns	7
tasks	37
ducky	4
legs	249
heating	2
ducts	6
avoid	371
scud	31
saw	4776
growling	6
outside	996
bedroom	177
removing	79
light	1137
fixture	5
porch	42
ring	712
doorbell	12
hears	255
releases	139
wind-up	4
frog	154
room	2210
scoots	3
hall	183
chase	1081
follows	579
downstairs	85
hannah	56
answering	32
grabs	454
reeled	4
fishing	43
pole	39
catches	200
creators	102
animations	97
8.5/10	12
fan	2472
pixar	1010
studios	249
released	777
2010	507
ago	988
decade	515
tell	1626
sky	252
limit	84
reach	304
deadpool	426
girl	3089
wade	86
wilson	363
frees	110
girlfriend	786
capsule	75
angel	162
killing	1248
slow	594
arcade	19
ryan	740
ryenolds	11
person	1662
play	1914
vulgar	132
based	1887
human	1882
experiments	78
romantic	1235
plus	373
marvel	483
experiment	224
hysterically	48
full	1931
raunchy	48
inappropriate	17
humor	2249
holiday	190
celebrating	56
pegging	14
xmen	217
happens	888
disfigured	53
disease	94
blind	162
woman	1939
joke	556
colossus	133
professor	491
mcavoy	168
stewart	261
parallel	135
timelines	51
dirty	590
sexy	392
violent	836
unabashedly	61
arrived	157
swallow	79
spiderman	96
rainy	132
alley	163
*you	87
reynolds	330
succeeded	135
skills	453
*	546
afford	81
okay	1124
nightmare	486
liam	443
neeson	359
kidnapped	299
daughter	1598
risks	130
destroyed	512
helicarrier	63
final	2202
fight	3039
litter	78
driveby	75
delivered	561
absolute	682
perfection	353
moment	1801
touching	1123
al	655
lil	118
regrown/	68
x-men	704
mansion	221
laughing	729
hugh	422
jackman/wolverine	35
references	407
priceless	171
fast	1017
gleefully	81
profane	48
fourth-wall-busting	33
subverts	31
superhero	672
wildly	102
entertaining—and	31
decidedly	82
non-family-friendly—results	30
shouldn	44
’	1961
t	1044
gigantic	57
audience	2391
18	155
loves	477
books	998
handle	246
real-world	12
language	465
violence	1179
%	1230
ve	77
neurotic	48
needy—and	25
entertaining	3896
s	1202
won	936
d	240
8	468
“	122
couldn	62
”	105
nemo	481
dory	616
remembers	181
following	684
shells	77
whale	72
likes	451
octopus	160
petting	19
dad	692
telling	861
clown	89
happy	1735
adorable	301
taught	275
valuable	92
lesson	207
fantastic	2640
children	1531
many	6297
lessons	222
charming	619
zoo	136
almost	3244
sent	657
grew	341
captured	564
truck	597
flies	283
curmudgeon	2
child	1414
looking	1911
opens	520
small	1263
features	476
several	1434
thereafter	42
cuteness	15
factor	212
dialed	9
11	265
rather	1642
attempt	847
invest	23
plight	110
saccharine	14
plausible	99
either	1301
fully	372
aware	309
cartoon	433
aimed	139
expected	1313
having	2572
severe	93
entirely	491
plot-driven	8
memory	596
loss	292
california	226
australia	91
herself	869
anyway	689
basic	256
might	2055
forgiven	92
list	804
implausibilities	12
errors	55
irritating	72
service	345
dull	485
septapus	7
tentacle	24
later	2059
stay	982
indefinitely	48
disguise	149
learn	743
within	797
seconds	307
marlin	127
enjoys	77
view	490
ocean	221
kid	1876
ended	892
crying	205
five	667
six	372
little	5966
boring	1487
disappointing	552
cameos	281
service-y	39
eaten	116
dat	57
short	1577
tho	136
paranoid	171
chased	224
glowing	106
squid	102
cry	665
cried	421
clam	45
tide	84
pool	473
dying	550
heck	212
ai	241
nobody	406
notice	651
carriage	95
moving	1015
parent	167
breathtaking	445
ta	368
cleveland	67
ooo-	52
left-oooo-to	52
right-oo-perfect	52
spectacular	551
sigourney	107
weaver	116
kept	989
highlight	278
finding	862
sia	58
song	1726
bond	3006
aquarium	95
drivers	99
somerset	139
wise	458
stronger	186
david	1579
mills	244
apartment	711
mere	224
feet	286
iconic	389
el	162
train	981
chicago	289
marvin	137
gaye	34
trouble	536
formally	35
viewed	111
punk	137
cop	926
dogs	662
interact	80
brad	910
pitt	719
exactly	2009
box	4126
disturbing	763
script	2032
superb	1243
dark	2496
scary	2568
different	2743
thriller-horror	34
captain	1174
desk	104
inside	1417
painting	217
leave	1625
prints	14
ask	696
interrogate	15
victor	162
hospital	686
doctor	806
chewed	9
tongue	115
mush	32
ordeal	83
evening	301
tracy	183
calls	906
requests	52
meet	1445
diner	188
miserable	65
urging	28
truth	841
request	60
pregnant	400
afraid	441
raising	78
live	1738
advises	59
husband	559
decides	807
sets	1084
insisted	22
partner	381
abortion	120
convinced	275
remorseful	38
day	3175
contact	214
fbi	431
library	214
borrowed	66
related	143
seven	391
sins	43
detectives	87
doe	61
visit	375
hidden	346
pulls	646
gun	1341
shooting	535
hits	607
tire	87
iron	789
subdued	54
gunpoint	76
lets	481
suddenly	724
flees	121
apart	542
themselves	930
arrive	647
se7en	210
surprise	897
single	922
clue	191
prior	213
occurring	30
typical	538
clichs	144
uniquely	45
dramas	39
fuels	46
drawn	442
entertained	484
events	912
unfolding	40
remain	317
uncompromising	57
shocking	347
thus	412
satisfying	485
initial	211
vision	551
fincher	419
surrounds	20
hunt	326
serial	341
killer	1249
inspired	549
dante	406
alighieri	10
divine	86
impurity	9
targeting	25
victims	267
torturing	91
pitting	30
underlining	12
seemingly	408
mouse	208
detective	828
develops	161
modern-myth	15
taking	1324
stage	374
counts	139
levels	357
important	1453
aspect	552
numerous	189
behind	1444
oppose	26
thrillers	296
bland	334
keeping	376
remains	481
fresh	769
progresses	128
dramatically	122
turns	1369
comfortable	116
asserted	12
gloomy	28
creating	322
fear	925
uncertainty	61
horrifying	204
gore	729
poetic	101
grain	12
rarity	35
nowadays	148
directed	909
skillfully	21
written	1383
andrew	676
walker	104
ingeniously	41
90	571
critical	200
acclaim	107
such	5699
silence	256
lambs	107
low	968
equal	195
sound	956
design	809
loudness	58
gunshots	122
especially	2755
theatre	420
canadian	70
sci-fi	877
worth	2392
viewing	534
knowing	723
title	1110
watchandvern	53
far	3122
kind	3322
lull	57
middle	598
met	909
died	1156
act	1090
firefight	44
loud	421
worst	1883
waste	584
amateur	75
farce	99
consist	56
sharlto	41
copley	43
needs	1175
45	120
min	64
cube	278
explores	100
instinctive	18
urges	45
survival	178
vs	140
humanitarianism	11
simple	1214
conceptual	11
genius	505
intend	30
power	1460
lies	283
mystery	535
classified	23
content	160
thoughts	326
instills	9
shaken	54
cinema	1454
feeling	1263
exposed	155
ugly	243
humanity	569
society	1096
bold	138
admit	678
few	3599
profound	69
affect	135
feelings	352
7/10	137
goofy	325
hilairous	48
deal	961
notch	376
freaky	105
mean	1772
1978	268
wet	158
pants	108
reputation	282
undeservedly	48
nick	956
russian	429
roulette	114
bullets	221
cpl	51
chevotarevich	47
christopher	619
walken	364
gritty	300
genuine	305
depiction	202
realistic	1049
settings	114
environments	100
robert	1161
de	792
niro	349
dies	765
encounter	296
comment	311
re	180
comments	466
criticize	42
miss	1068
course	2319
advance	160
supposed	920
show	2918
various	374
affected	117
worked	565
nearly	893
powerfully	13
trimmed	11
careless	37
frat-boy-like	6
immaturity	22
revolve	14
frivolity	6
senseless	25
boyish	9
creates	259
stark	599
devastated	106
relatively	227
unaffected	12
personalities	124
stayed	221
stanley	72
strong	2001
points	584
outstanding	807
actor	3230
technical	392
deficiencies	7
matters	260
nitpicking	51
compared	551
construction	141
son	2006
nee	72
trailer	1081
piece	1588
tomorrow	320
inherent	110
vice	183
morgue	97
bryan	483
rescues	198
boat	508
hero	2072
singer	324
undeniably	146
slick	183
largely	225
brainless	108
exercise	165
grimly	35
professional	195
efficient	111
revenge	753
quantum	39
solace	44
jason	2461
bourne	1110
confused	504
barrel	22
pistol	213
3/4	22
spy	589
battle	1391
put	2371
edging	5
step	567
ahead	534
between	2997
jaw-dropping	31
sequences	870
international	570
trafficking	13
horrible	1020
comparison	306
expect	1503
surprinsingly	13
rt	217
fastest	65
93	73
minutes	1743
maggie	249
grace	576
poor	1144
emma	375
watson	299
inspector	303
vodka	58
martini	40
5.5/10	66
fuck	1248
shaky	204
cam	139
pity	311
wonderful	2041
portrayed	910
inevitable	169
smaltz	25
goat	115
ultimately	670
unnecessary	591
college	522
clean	372
buddy	549
elf	326
relief	395
portrayal	574
laugh	1363
burps	31
massive	413
snowball	34
central	431
park	626
started	1039
eating	348
candy	212
sweets	27
meal	165
ferrell	212
anchorman	119
comical	279
packs	122
lunch	132
biological	72
father	2874
2003	384
supporting	1174
cast	3922
bob	999
newhart	23
refreshing	397
innocence	303
dvd	1048
july	89
learned	474
ways	863
highly	1000
recommend	1479
adults	804
wo	1337
regret	126
treat	392
yourself	587
family-friendly	7
portraying	160
means	649
meghan	23
unapologetically	100
nathan	152
lillian	68
bathroom	456
accident	319
wedding	635
dress	365
street	1562
drunk	304
airplane	286
moves	461
again	5767
driving	465
rhodes	61
bake	18
food	393
girls	866
sick	223
favourite	4126
decided	392
gut	71
correct	261
couple	989
humorous	396
chuckled	14
involving	471
poop/vomit/farting/burping	9
lame	331
slapstick	285
lots	807
shots	352
sophisticated	211
classy	97
trashy	123
honestly	1217
rated	401
r	207
adult	622
version	1386
equivalent	122
spongebob	29
slowly	515
stretched	54
seem	1656
thrown	536
kristen	174
wiig	66
score	1286
progress	71
holes	421
caught	874
rolling	176
eyes	1334
develop	179
literally	903
outcomes	9
theater	1736
regards	93
desperate	262
nudged	20
broken	402
rib	22
intentions	111
previews	155
added	772
circle	416
took	1544
truman	310
conquers	22
fears	142
sail	88
storm	351
personal	810
bests	20
relatable	313
lived	401
predictability	38
escaped	460
wanting	395
island	637
obscure	84
tremendous	111
deeper	377
weaker	118
forget	1010
soundtrack	820
head	2033
cristof	19
eternal	124
sunshine	173
unassuming	26
provoking	371
carrey	403
underrated	745
sits	183
burbank	27
turman	23
overcome	301
curiosity	100
jim	1119
brought	1193
improve	78
actors	2608
serious	1003
cheering	145
sought	51
realizes	992
sequels	1499
travesty	65
corleone	294
clemenza	49
rug	135
vito	220
kills	1480
fanucci	29
labelled	24
companion	70
compliment	70
prequel	328
rise	502
decline	49
micheal	174
uncanny	33
ability	514
deniro	153
pacino	531
saying	1562
nuclear	234
noise	98
prove	275
respective	86
crafts	39
standout	142
ensemble	211
changed	732
cold	597
ruthless	203
unemotional	16
betray	33
price	355
paid	228
gangster	318
pleas	40
fredo	26
brother	1077
flashback	185
1917	2
don	542
partnership	12
sal	33
tessio	10
aprea	1
wants	1306
share	335
profits	14
week	348
reluctant	101
hands	842
accept	329
sixth	154
demanded	37
$	3885
600	17
immediately	627
afterward	72
neighborhood	93
festa	1
murders	220
hallway	72
rejoins	15
four	1056
stoops	22
infant	111
january	68
1959	22
nevada	18
snow-covered	1
lake	325
tahoe	9
compound	69
fleeing	65
cuba	73
hagen	32
roth	49
suffering	109
stroke	14
recovering	58
miami	115
bodyguard	59
hiding	236
york	914
informs	194
kay	221
miscarriage	28
distraught	48
news	464
furiously	41
demands	247
unable	371
creepy	1204
guerrillas	16
guests	61
flee	220
chilling	336
heist	214
frazier	141
achieve	169
dalton	196
russell	524
smart	1591
ringleader	33
operation	354
case	1137
robbers	170
clothes	153
painter	21
suits	238
knew	1168
listening	165
device	294
outsmarted	73
recording	120
speech	441
number	741
safe	473
jewels	44
stolen	226
told	1112
listen	368
women	860
crew	1314
octane	6
action-thriller	28
midpoint	3
transforms	77
breezy	60
tongue-in-cheek	77
reminiscent	148
sting	60
over-plotted	9
twists	509
thankfully	192
mostly	726
non-expected	7
contrivances	45
abound	27
ie	37
target	203
meticulously	41
designed	197
compensates	19
lack	959
3d	974
characterization	123
save	1484
denzel	259
ambitious	269
policeman	80
achieves	150
level	928
interaction	162
sidekick	111
chiwetel	48
ejiofor	59
serenity	11
fame	123
frustrated	130
willem	44
defoe	14
sparkling	52
dialog	379
clive	198
owen	263
convincing	613
criminal	315
mastermind	57
wearing	346
mask	310
harmless	81
spike	149
lee	1261
fare	151
versatility	5
hint	106
back-story	28
heavy	387
issues	313
macguffin	6
slight	64
significance	81
resolution	115
neat	90
structural	37
trickery	30
flash-forward	6
hinting	14
toward	362
aftermath	120
giving	950
used	1910
sparingly	14
cleverly	134
progressing	15
wishing	55
rare	675
maybe	1997
flick	1416
mrs.	200
o'brien	55
chastain	33
warmth	112
montages	16
profession	100
dealt	167
developed	439
universe	614
witnessing	43
growth	123
born	616
darkness	457
appears	981
heaven	222
progression	99
shown	746
evolving	61
beautiful	2607
depict	89
spirituality	34
modern	1035
tried	1035
others	1779
decisions	172
artistic	115
future	1565
watches	275
sun	313
boyhood	9
reminded	478
impressionistic	8
sequence	1202
including	868
bits	273
voice-overs	24
closure	119
satisfaction	69
plain	292
suck	265
presenting	38
objective	51
withhold	3
mention	580
reactions	187
observed	63
parking	129
afterwards	153
spilled	23
lemonade	20
attentive	21
yawns	6
uncomfortable	247
fidgeting	10
filed	8
hated	500
feared	66
plow	9
storefront	4
praised	142
merits	121
remained	145
lukewarm	7
negative	412
impression	142
discussing	141
philosophical	139
infuriated	39
1950s	75
3rd	248
established	135
tone	707
presented	175
series	4472
vignettes	8
focusing	211
love-hate	4
relationship	992
mirrors	68
goodness	269
jerks	14
struggling	154
portion	64
thank	490
everybody	459
sheesh	12
skip	125
crap	574
flashes	128
wait	1556
extended	150
ok	1391
fictional	245
miller	584
crossing	167
unbelievable	268
scenarios	102
crap-fest	15
parts	1530
origin	314
stories	837
elaborate	345
shockingly	70
afleck	75
knocking	207
how-to-be-recognized-as-legit-director	75
direct	234
terrible	1500
alot	274
rotten	375
tomatoes	301
tge	13
ancient	182
edward	1036
christian	227
slater	73
stereotypes	184
wandering	59
killed	2544
extent	202
occupation	26
motivation	108
began	280
nowhere	352
pounding	64
techno	23
track	469
happening	459
drama	1505
stiff	39
wooden	194
delivery	217
reading	521
cue	27
cards	92
comprehending	8
lines	1358
delivering	208
adr	25
sounded	168
recorded	39
care	1456
hit	1212
marks	63
robotic	38
movements	149
listless	46
automatons	8
whisked	12
implausible	74
rhyme	16
nine	96
bucks	99
guess	1384
surprised	1324
turning	344
supposedly	101
confront	76
creatures	387
let-down	36
ben	847
stiller	242
cowboy	87
friendly	262
rex	113
drinking	148
fountain	116
disliking	14
hey	557
tickets	83
monday	40
night	2425
funnier	484
anticipated	72
famous	454
*in*	10
situations	466
adam	492
sandler	243
usuaully	10
passive	11
element	411
propelled	19
group	1460
gus	93
mcphee	9
atilla	9
hun	11
pacific	40
interest	539
nay-sayers	11
judge	244
tut-tut	7
wastes	94
kicking	67
gear	47
special	2997
t-rex	42
enjoy	2445
delightful	224
cloak	52
prejudice	111
disappoint	299
shoot	524
2000	313
awakens	85
coma	51
brutally	199
murdered	333
invasion	198
agent	928
gorman	26
amnesiac	19
identifies	49
perpetrator	21
former	528
universal	286
soldier	622
unisol	41
luc	235
deveraux	156
adversary	53
clone	195
nemesis	144
negotiates	29
magnus	30
injects	73
serum	39
control	756
activates	48
sleeper	76
cloned	6
generation	604
unisols	41
regeneration	16
brothel	12
patrons	36
exceptional	223
physical	395
resistance	126
introduced	634
separatist	24
led	424
wayward	6
turn	1288
establishing	45
ruled	25
litterally	3
inane	10
treated	281
props	79
extremely	1208
35	32
million	671
dollars	309
late	827
taco	59
abyssmal	6
prized	12
artifact	30
fell	548
cracker	41
armor	97
backgrounds	58
straight	628
bargain	36
bin	186
local	630
store	611
fantasy	1126
camcorders	6
across	967
globe	57
yards	26
crushed	141
remotely	209
entire	2058
proceeding	11
demadar	8
notably	80
balked	11
script/quality	11
filming	252
presence	417
insult	61
th	103
producers	381
ashamed	138
hundreds	184
thousands	155
loyal	148
waiting	761
inspiring	185
hobby	30
prodigious	4
material	781
among	591
notable	85
otherwise	332
poorly	380
received	391
cameo	596
appearances	38
richard	838
parody	203
tv	2108
program	201
maze	123
baker	118
unexpected	579
gem	346
lovely	419
message	1134
topical	163
assyrians	105
mentioned	353
depicted	251
crappy	228
considering	662
excited	632
tinker	123
bell	271
ready	478
journey	699
fairy	463
gary	205
ok.	114
color	407
terrence	72
cap	150
understand	1776
4.9	2
date	771
3yo	3
curious	185
tb1	3
satisfactory	28
dozen	209
until	2025
grabbed	67
nmt	2
media	326
safety	200
tb	3
marginal	8
promoted	54
tink	2
fairies	8
suffer	150
8/10	101
hate	1479
journeys	30
north	281
patch	54
terence	116
restore	74
pixie	26
dust	102
tree	497
gain	216
perspective	461
shave	54
v	447
vagina	65
passes	262
greats	63
freedom	341
80s	208
crazier	71
relevant	311
unashamedly	43
5th	113
november	183
fawkes	49
holding	499
'meh	30
graphic	266
novel	750
protagonist	296
code	321
fighter	330
evey	61
sacrifices	119
commits	56
natalie	323
portman	151
rain	352
breakfast	187
facts	181
governments	57
intersting	72
ingenous	26
eve	284
together	2598
hideout	58
places	365
scarlet	147
carson	44
sutler	23
lapel	7
creedy	14
shoots	612
remove	176
orders	455
fire	1144
barrage	74
composes	8
rushes	159
forward	659
knives	76
reload	23
multiple	532
wondering	183
aloud	22
beneath	275
bullet-proof	8
neck	247
breaks	621
swiftly	67
staggering	24
tunnel	218
removes	66
large	670
metal	274
chest	296
plate	72
immediate	63
continues	712
bleed	40
profusely	6
wounds	126
waits	87
contemplating	28
collapsing	64
'is	14
finished	217
confessing	24
fallen	193
existence	145
2006	479
9/11	104
silly	914
lair	121
dominoes	12
cause	812
reminds	500
rorschach	41
watchmen	84
changes	408
source	502
shitting	43
sitting	575
rad	48
bloody	420
masterpiece	1659
generally	394
contemporary	169
iffy	32
choices	261
directors	475
super	938
solid	1370
1984	89
useful	125
sad	1394
hulk	219
loki	44
america	1103
invading	32
aliens	661
spinoff	71
lacks	258
energy	527
spin	199
avengers	267
ineptly	18
woefully	40
miscast	29
disaster	290
summer	1180
pared-down	10
rational	30
double	317
peel	35
sensually	12
uma	85
thurman	211
man/tony	7
badass	309
steed	29
assists	10
changing	168
boots	61
throws	424
rag	14
doll	349
punched	82
thor	51
credit	467
macnee	12
scepter	7
strongest	110
decide	352
frisbee	11
ultron	46
quotes	186
weathering	14
spader	24
f****	24
lizard	46
king	1396
please	927
heimdall	29
terrifying	654
cockpit	47
quintet	41
unintentionally	92
coulson	43
intel	47
shield	124
directly	246
bombarding	32
von	92
strucker	32
base	388
wear	135
adidas	34
horror	5839
describes	95
picked	198
mjolnir	60
applause	104
worthy	730
nooo	80
quicksilver	133
fix	201
tractor	75
uncle	291
collectively	63
wildest	28
nightmares	126
--	2093
imagination	393
fiennes	74
improved	96
cheeky	101
campy	161
form	915
entendre	17
somewhere	282
sensibility	83
omnipresent	22
nonstop	33
clank	20
swank	29
mummy	209
fill	198
gaps	36
imhotep	41
addition	494
scorpion	43
effort	544
screentime	25
tangent	29
favour	65
rivalry	58
originally	194
mistook	21
rachel	519
weisz	201
reincarnated	5
differently	136
tangents	6
substantial	79
running	1072
length	240
oded	9
fehr	12
bang-up	3
providing	154
mad-max-cum-indiana-jones	3
groovy	13
costumes	160
tattoos	26
eight	213
ten	806
badly	398
constructed	71
matinee-style	3
agreed	677
picking	70
1933	5
rick	352
brendan	214
fraser	67
evelyn	39
o'connell	11
exploring	114
pyramid	28
egyptian	5
thebes	3
alex	1111
meatloaf	35
sofia	32
boutella	16
spelling	64
kurtzman	20
considered	306
accepted	123
seth	532
powers	676
crusader	51
tomb	66
jewel	194
attacked	657
hollow	239
lightweight	92
entertainment—not	19
unpleasant	77
definitive	93
action/adventure	68
constant	283
today	1312
1999,2001,2008	6
spookyverse	7
huh	166
jenny	379
shadows	125
truly	2290
mallory	76
seduced	51
mickey	359
knox	71
woodly	14
harrelson	49
married	383
record	337
edgy	123
cup	103
tea	134
visually	565
murder	755
arrested	329
bronco	16
cruise	881
streets	337
los	262
angeles	251
questions	521
'natural	12
killers	140
raises	139
whether	597
television	826
despise	63
wayne	240
gale	152
downey	272
jnr	8
accurately	92
portrays	409
false	140
hysteria	28
machismo	12
tabloid	10
figures	214
geraldo	43
riviera	16
oprah	14
windfrey	4
et	11
characterisation	53
archetypal	20
figurehead	9
newsrooms	5
mobile	44
phones	54
smoking	199
cigarettes	45
coffee	166
deceitful	16
private	418
writers	511
60	190
paranoia	137
faces	315
realising	52
10,000	26
mountain	202
valid	105
basically	960
bludgeons	8
nbk	25
*is*	42
ultra	45
indulgent	88
controversy	93
generated	63
criticizing	25
fair	380
abstract	74
observation	76
'like	8
culturally	73
significant	256
proposing	11
anti-violence	11
agenda	33
rape-revenge	10
fantasies	43
fetishize	10
rape	111
demonize	10
entertain	302
entertainment	1063
pit	244
gory	405
protest	27
*just*	11
self-effacing	12
intention	137
field	353
criticism	159
attached	171
object	133
'boom	4
corporations	45
nation	109
rely	103
showed	1031
brilliance	119
pirate	237
frustratingly	90
mermaids	68
mermaid	128
healed	56
muchness	27
clothesline	34
dangle	33
obligatory	74
pieces	531
familiar	636
incoherent	86
crammed	63
pointless	391
installments	101
necessity	97
streamlining	27
bloated	76
easier	136
franchise	1336
tired	404
penelope	68
energizes	28
fuss	75
eye-popping	92
escapism	116
terrific	960
flair	90
chases	518
sword	304
fights	572
handles	110
competent	192
tritely	27
cluttered	44
stentorian	27
tones	89
anywhere	409
chalice	4
containing	106
tear	177
drained	45
blackbeard	41
intends	110
circumvent	2
fated	3
fatal	109
one-legged	2
whitecap	2
traps	198
philip	188
swift	55
sam	2019
claflin	3
captive	64
missionary	9
names	364
syrena	5
strid	2
bergs-frisbey	2
sends	339
sparrow	286
retrieve	175
chalices	13
len	6
grounded	65
ship	1355
arrives	741
barbossa	77
spanish	108
pearl	85
forcing	147
amputate	2
leg	264
defeat	240
nearby	286
camp	377
tricked	64
shedding	12
collects	49
gibbs	36
reunited	149
helping	213
confiscated	38
magical	296
compass	17
exchange	252
bizarre	315
nail	174
biting	92
capitan	10
advanced	198
screening	300
johnny	773
depp	320
grown	377
action-packed	157
tale	964
betrayal	210
youth	247
demise	64
crosses	141
paths	47
cruz	49
loveor	3
con	64
artist	369
fabled	15
forces	522
aboard	151
queen	698
anne	324
formidable	43
ian	362
mcshane	23
happily	163
confirm	81
intelligently	18
subliminal	14
avatar	223
blair	102
witch	355
recent	706
production	743
artifice	19
the-artifice	5
com	116
pirates	321
shrek	1390
8.25	25
zebra	70
julien	81
pick	534
according	1727
grandkids	8
families	181
technically	196
'uneven	4
*that*	8
needlessly	60
feedback	21
imdb	253
presentation	166
quick-paced	7
bright	287
ears	105
unique	1107
quirky	289
i.	333
e.	408
nonchalantly	12
subway	149
stuff	1095
accounts	86
catch	615
drift	70
melman	50
situation	561
hopeless	65
digs	20
grave	218
beach	323
anxiety	118
silent	423
paused	59
laughter	404
walked	444
atrocious	60
listened	57
poll	128
democracy	86
admittedly	181
drinks	209
deep	1043
hillarious	111
reccomend	74
episode	906
meh	252
28	295
15	400
respek	94
mantzoukas	202
podcast	100
decent	1333
madagascar	305
ride	1148
flat	538
listed	147
jeffrey	138
characterwheaties	96
comedic	375
chucky	559
anti-hero	133
rooting	164
unfairly	45
panned	79
clearly	813
par	284
continuation	115
storyline	842
conflict	305
mr	373
sullivan	240
yo-yo	39
surpass	11
factory	167
finale	294
foul	89
mouth	294
liability	12
asset	35
slack	7
certainly	1454
ups	85
downs	41
romance	770
fellow	294
cadet	17
distraction	100
plastic	247
star	3160
brushed	4
aside	369
favor	157
desire	188
swap	12
souls	70
someone	1685
change	1158
tyler	453
dimensional	44
uninteresting	82
carry	238
vincent	738
concerned	244
became	808
shameful	24
hokey	49
entry	345
caliber	79
trash	268
theatrical	188
early	683
'90s	11
root	204
befriends	128
introduces	214
malevolent	23
hide	327
unknowingly	29
sheep	82
wish	1343
toned	73
voodoo	65
angle	136
charles	459
ray	595
voiced	277
skellington	27
bodycount	57
rats	82
favorites	572
folks	246
*not*	50
freaked	87
dourif	89
commentary	462
audio	75
scream	805
amusing	352
pals	52
ceo	47
paralyzes	30
dart	38
spine	88
piano	188
wire	153
80's/early	27
friday	720
13th	418
nudity	176
glovers	26
ftmfw	13
donation	12
sliced	24
coroner	46
throat	107
trish	33
kimberly	60
beck	28
appeared	464
alfred	219
hitchcock	276
likable	371
relate	617
crispin	8
glover	54
nerdy	95
horny	7
unmatched	5
tommy	746
jarvis	33
darn	88
the-	1
chapter	585
throwing	160
gorgeous	492
sisters	30
blondes	1
mix	316
tits	155
ass	577
gratuitous	142
bloodbaths	4
count	266
ensues	113
reasons	466
searching	144
corkscrew	4
kitchen	153
emerges	136
slams	66
jimmy	236
drives	383
meat	83
cleaver	20
personality	562
anyone	1501
f13s	1
deaths	453
briskly	18
surprisingly	871
majority	242
disposable	39
balance	310
writing	1090
teenage	490
fodder	26
inclusion	15
seasoned	52
backpacker	3
touch	584
sh*t	28
kicked	147
arc	283
yep	307
pathetic	229
joe	1037
piranha	122
fishy	62
extreme	255
mayhem	183
creature	464
revolutionary	235
van	811
slipped	53
devoured	24
maddy	47
afternoon	153
travis	52
lazy	349
lifeless	200
scramble	12
key	663
handcuffs	22
fearing	36
ashley	120
swim	131
proves	425
mistake	355
devour	20
cuffed	6
roof	424
window	675
stump	15
smashes	57
glass	404
sinks	89
screaming	299
via	123
lying	184
motionless	9
floor	534
console	29
shelby	49
jetty	8
swarm	26
piranhas	54
proceed	81
planks	4
jumps	394
floating	133
busey	3
opening	1361
wasted	246
cow	63
farts	53
suppose	261
b-movie	111
payoff	99
55	12
presents	227
underwhelming	53
filmed	464
sucks	293
suspend	52
disbelief	99
althought	2
longer	734
70	185
followed	317
ton	104
outtakes	1
weinstein	3
company	608
theaters	303
vod	28
gulager	1
allowed	433
alexandre	23
aja	41
understood	204
positive	401
hasselfhoff	1
chuckle	101
nude	68
80	537
loudly	81
conjuring	372
premier	63
classics	229
scare	274
emotionally	487
exhausted	128
hindu	68
bought	229
bible	141
gasped	94
ed	657
lorraine	207
apparition	69
except	895
defeated	195
interviews	111
bill	858
figure	620
priest	237
shorty	35
ghost	610
gross-out	67
sloppy	97
rushed-out	12
product	275
laughs	1300
butler	62
gross	351
crude	308
paper	290
anna	356
farris	4
surprising	652
regina	171
marlon	81
shawn	26
exorcist	601
poltergeist	188
haunting	267
charlie	638
angels	215
ons	2
tim	684
curry	7
tori	28
expecting	1249
bashing	6
comedies	620
mood	342
ruined	277
moviegoers	93
twist	688
towards	994
claps	42
wan	401
randi	38
funeral	255
wrenching	109
toll	76
poignant	233
grief	85
trauma	61
burned	185
lees	8
chicken	165
freezer	9
casey	262
affleck	226
fits	214
glove	43
win	910
manchester	61
janitor	34
boston	207
nephew	41
task	188
strangely	195
raw	224
beautifully	801
sucker	45
winter	198
bore	89
grasp	98
clumsy	129
dramatic	685
punches	199
usually	715
humans	579
skipping	47
curve	15
ball	239
allow	216
whenever	326
believed	202
emotion	540
melancholy	102
gasp	28
unresolved	15
godspell	15
spot	617
chandler	72
'please	19
stopping	77
haunts	82
terribly	234
overrated	336
lucas	182
hedges	32
freezer/panic	26
fucked	228
**melancholy	20
sea**	20
michelle	501
williams	375
kenneth	119
lonergan	21
must-see	153
festival	554
masterfully	117
higher	141
praise	265
textured	19
richly	85
enveloping	19
ranks	127
carefully	241
compellingly	51
exquisitely	38
ragged	20
doesn	51
p13	22
snow	411
re-title	20
hunger	279
games	800
adaptation	802
phasma	58
t-bag	20
remy	245
danton	22
tiny	248
cult	643
continued	151
epilogue	40
katniss	387
prim	33
placee	24
gripping	354
peeta	239
item	124
imagine	514
move	974
harry	3069
potter	900
darker	321
mature	243
claim	151
throne	123
twilight	347
space	966
juvenile	105
enthralling	89
science	1100
fiction	1434
intelligence	396
pulse-racing	20
value	362
rough	217
handheld	42
camerawork	84
blood-flecked	14
residents	78
district	175
tributes	60
enemies	186
reluctantly	99
enthusiasm	88
trilogy	930
compelling	463
madness	89
futility	37
themes	435
woven	56
discussed	143
immersed	72
poverty	82
nonexistent	40
arena	82
bloodless	28
walking	583
impact	398
rue	39
death-	10
heart-wrenching	106
book-	9
dynamic	398
conflicted	93
unconvincing	67
grows	319
perhaps	1034
biggest	601
hungry	232
overlooked	177
capitol	78
exploitation	118
brutal	607
wholly	45
embraced-	12
celebrated-	12
districts	17
observes	24
button	89
consumed	37
feeding	37
defines	38
eat	384
weakest	229
jones	1291
technodrome	52
sheamus	27
amell	65
mikey	95
monsters	428
lose	607
gat	37
dang	94
mind	1941
ninja	67
turtles	153
fought	312
shredder	102
raphael	115
aggressiveness	37
rebellious	76
resonated	38
coolest	202
cgi	1166
pull	572
flawlessly	103
significantly	46
locations	145
90s	66
pigeonholed	5
'just	11
'family	16
aforementioned	41
'surfer	4
criticised	16
taste	436
lingo	12
quote-worthy	4
splinter	49
exclaiming	5
cowabunga	11
b-grade	16
lovable	204
chief	263
sterns	11
tatsu	9
angst	23
cheekiness	8
michelangelo	22
musical	677
ranges	35
fitting	90
unlike	593
follow-up	200
mc	11
hammer	153
songs	676
career	840
shameless	29
antique	21
under-rated	75
comic-book	127
adaptations	77
defining	151
childhoods	28
bebop	27
rocksteady	27
krang	50
yay	39
dumb	812
april	119
test	408
amazons	29
combat	295
acclaimed	76
dc	152
tango	72
ethics	31
acts	362
lasting	56
consequences	109
pits	38
diametrical	4
opposites	16
weary	63
retired	109
army	641
lt	61
looses	3
sight	263
chris	1611
donnelly	5
prep	7
scholarship	17
owing	13
richer	31
exclusive	35
stunt	185
escort	56
nyc	37
rip	207
roaring	26
fateful	13
decision	306
preppy	5
earn	119
travel	491
advice	175
crisis	102
interplay	39
boggling	16
riveting	222
grisham	5
inner	169
core	326
unhappily	2
tougher	16
missed	792
ballroom	6
actress	1063
anwar	2
smooth	139
couch	128
potato	85
tempted	41
yellow	195
pages	66
search	397
slade	137
donna	56
por	7
una	12
cabeza	7
floor-	2
disciplinary	16
hearing	304
orations	2
scent	36
glamorous	47
requires	114
defense	103
regan	302
merrin	277
2004	390
lankester	59
granville	31
francis	193
results	259
astonishing	154
massacre	235
stellan	37
skarsgard	4
faith	299
archaeologist	18
capacity	57
east	121
africa	201
discovered	406
1500	1
older	537
relic/statue	1
pazuzu	71
infamous	58
demon	645
bulk	32
merrick	101
known	629
kenya	1
occurrences	21
surrounding	156
town	1008
located	177
european	145
natives	65
knocked	274
stem	12
morgan	87
creek	27
initially	213
schrader	16
canned	36
result	488
visceral	139
hired	189
renny	37
harlin	62
massacred	10
gorier	70
servicing	4
maximum	66
sparse	17
noticeably	6
hyenas	25
handled	256
current	234
trend	57
monochromatic	21
strongly	128
present	605
overused	58
blues	61
cinematographer	98
vittorio	24
storaro	26
embed	3
browns/sepia	3
grays	13
aiming	25
apocalypse	412
1979	142
willard	7
martin	518
sheen	178
encounters	294
kurtz	5
brando	90
chosen	171
ford	387
coppola	66
amusingly	1
reference	300
ceiling	167
similarly	65
breaking	414
mirror	328
integrate	8
mythos	27
deepening	13
stylistic	83
subtextual	1
ties	109
extension	8
novelist	45
caleb	26
carr	32
treatment	245
wrote	405
languishing	3
vaults	10
employed	22
polisher	3
conveyed	82
manner	300
closer	316
studied	3
circa	5
1973	51
sensibilities	29
works	1129
popcorn	228
subtexts	1
colonization	33
domination	15
non-european	13
cultures	57
religious	130
cultural	83
appropriation/absorption	1
preexisting	1
latter	114
subtext	44
interestingly	27
literal	50
focus	585
primary	57
attraction	107
behind-the-scenes	6
blunders	25
dissuade	10
deserves	944
appreciated	129
patsey	56
status	229
smith	1250
platt	71
solomon	84
plantation	28
daniel	1045
lewis	205
blood	1571
slave	105
speak	463
unless	218
prepared	318
beaten	226
utilize	10
pools	5
express	250
endure	72
maintains	21
certain	1016
dignity	47
nobility	37
affecting	137
subtlety	173
speechless	102
complete	917
awe	103
fassbender	62
impressive	868
besting	2
shame	529
steve	723
mcqueen	66
12	350
edwynn	2
epps	60
vicious	86
demonic	96
slaver	2
loathsome	28
disgusting	105
likely	621
anger	212
management	23
embodies	67
ultimate	406
flawed	470
beings	158
cruelty	78
malignant	2
noteworthy	32
slavery	66
limiting	10
exploration	88
topic	97
solely	61
slaves	34
increases	38
scope	156
affects	50
profited	3
benedict	53
cumberbatch	170
treats	59
semblance	25
respect	554
kindness	49
trapped	235
confines	31
institution	74
destructive	110
social	517
construct	14
drains	23
touches	194
quandaries	5
race	586
livestock	7
tools	65
confronted	169
grim	135
reality	778
naive	99
romanticism	57
wind	143
django	68
unchained	41
serve	175
digestible	5
despair	96
misery	78
overwhelming	68
armsby	3
ugliness	12
blunt	113
haunt	103
reeling	22
achievements	22
matt	393
damon	303
singing	701
mars	123
rover	49
tonight	437
ridley	190
marshmallow	61
martian	98
straightforward	96
survival-and-rescue	20
metaphysical	27
trappings	33
interstellar	144
persistent	78
theme	793
nasa	145
mark	1208
struggle	515
survive	455
watney	174
farm	167
montage	176
vlogs	36
instructor	63
indicates	48
creative	571
scifi	94
garden	144
realized	459
earth	1101
clich	156
months	471
terminally	21
ill	144
eagerly	34
awaiting	19
trait	15
highlighted	44
smug	20
identify	187
sympathize	60
honest	729
cared	197
survived	281
landscape	180
rendered	264
en	74
credible	77
clouds	61
aspect/psychology	6
marooned	7
strange	824
gravity	163
edge	944
seat	800
apollo	228
13	241
standard	457
shell	83
nerd	43
therefore	187
expectations	948
disappointed	990
agencies	8
displays	127
loneliness	64
grow	245
potatoes	32
one-	7
electronic	45
communication	33
display	328
yea	332
sorry	540
update	98
clip	114
hah	58
'whole	12
wide	192
shuffle	25
shakespearean	52
understands	193
bummed	32
amazon	25
prime	308
netflix	111
hulu	10
pawn	34
karen	340
eiffel	16
identifiable	35
write	563
author	112
writer	553
inadvertently	81
controlled	81
crick	43
brushing	44
teeth	248
questioning	112
voice	1343
ana	84
pascal	19
bags	81
flour	12
calling	194
flowers	77
visits	234
severely	187
patients	100
awareness	65
stunned	123
nurse	180
continually	35
reveal	417
assumed	122
involves	205
irs	17
strict	31
routine	147
narrating	6
actions	606
suspicious	135
attempting	203
inexplicable	24
immenent	2
randomly	40
spliced	14
thompson	87
battling	135
existential	38
innocent	546
life-altering	15
depressing	231
kaufman	235
kaufman-written	2
lacking	304
soundtracks	29
flours	14
believes	370
mistaken	100
reassesses	3
gyllenhaal	215
shines	337
makings	7
sometime	59
problems	556
proud	246
entries	43
helm	63
coupled	52
intoxicatingly	2
trip	568
beats	259
weeks	295
9/10	129
terrifyingly	36
derivative	109
blew	364
dynamite	110
ot	38
dispicable	20
remeber	210
replacing	51
drain	26
resonance	84
uncharacteristically	4
penned	22
wes	391
craven	247
jonathan	202
shakespeare	108
clunkers	7
wonder	849
dump	114
payed	17
one-dimensional	53
heads	342
'napoleon	6
napoli	4
scrawny	5
deranged	69
instinct-driven	8
villains	779
deepest	41
giddy	58
'the	405
hills	235
tough	787
garbage	481
generic	218
ii	1085
plague	76
frightless	1
unoriginal	105
frantic	66
stick	365
thirty	116
warn	95
grit	130
build	417
dismembering	6
tame	15
state	434
affairs	29
deformed	41
